yahalit/Ilia/Sw3/BolshoyManipCpu2R3/F2838x_driverlib/driverlib/sysctl.h
#ifndef DOXYGEN_PDF_IGNORE
//
// Fractional multiplier (FMULT)
//
#define SYSCTL_FMULT_M      0x0000C000U // Mask for FMULT value in config
#define SYSCTL_FMULT_S      14U         // Shift for FMULT value in config
#define SYSCTL_FMULT_NONE   0x00000000U //!< No fractional multiplier
#define SYSCTL_FMULT_0      0x00000000U //!< No fractional multiplier
#define SYSCTL_FMULT_1_4    0x00004000U //!< Fractional multiplier of 0.25
#define SYSCTL_FMULT_1_2    0x00008000U //!< Fractional multiplier of 0.50
#define SYSCTL_FMULT_3_4    0x0000C000U //!< Fractional multiplier of 0.75

//
// DCC module selection for checking PLL clock validity
//
// Mask and shift for DCC module base address in config
//
#define SYSCTL_DCC_BASE_M    (uint32_t)0x30000000U

#define SYSCTL_DCC_BASE_S    28U

#define SYSCTL_DCC_BASE_0       0x00000000U //!< DCC0 module
#define SYSCTL_DCC_BASE_1       0x10000000U //!< DCC1 module
#define SYSCTL_DCC_BASE_2       0x20000000U //!< DCC2 module


//
// Oscillator source
//
// Also used with the SysCtl_selectOscSource(), SysCtl_turnOnOsc(),
// and SysCtl_turnOffOsc() functions as the oscSource parameter.
//
#define SYSCTL_OSCSRC_M         0x00030000U // Mask for OSCSRC value in config
#define SYSCTL_OSCSRC_S         16U         // Shift for OSCSRC value in config
//! Internal oscillator INTOSC2
#define SYSCTL_OSCSRC_OSC2      0x00000000U
//! External oscillator (XTAL) in crystal mode
#define SYSCTL_OSCSRC_XTAL      0x00010000U
//! External oscillator (XTAL) in single-ended mode
#define SYSCTL_OSCSRC_XTAL_SE   0x00030000U
//! Internal oscillator INTOSC1
#define SYSCTL_OSCSRC_OSC1      0x00020000U

//
// Enable/disable PLL
//
#define SYSCTL_PLL_ENABLE       0x80000000U //!< Enable PLL
#define SYSCTL_PLL_DISABLE      0x00000000U //!< Disable PLL
#define SYSCTL_PLL_BYPASS       0x40000000U //!< Bypass PLL

//Mask to check the PLL configuration selected

#define SYSCTL_PLL_CONFIG_M     0xC0000000U

#define SYSCTL_DCC_COUNTER0_TOLERANCE   1U
#define SYSCTL_DCC_COUNTER0_WINDOW      1000U   // DCC Counter0 Window
//*****************************************************************************
//
// The following are values that can be passed to the SysCtl_setAuxClock() API
// as the config parameter.
//
//*****************************************************************************
//
// Auxiliary clock divider (AUXCLKDIV)
//
#define SYSCTL_AUXPLL_DIV_1        0x00000000U //!< Auxiliary PLL divide by 1
#define SYSCTL_AUXPLL_DIV_2        0x00000100U //!< Auxiliary PLL divide by 2
#define SYSCTL_AUXPLL_DIV_4        0x00000200U //!< Auxiliary PLL divide by 4
#define SYSCTL_AUXPLL_DIV_8        0x00000300U //!< Auxiliary PLL divide by 8
#define SYSCTL_AUXPLL_DIV_3        0x00000400U //!< Auxiliary PLL divide by 3
#define SYSCTL_AUXPLL_DIV_5        0x00000500U //!< Auxiliary PLL divide by 5
#define SYSCTL_AUXPLL_DIV_6        0x00000600U //!< Auxiliary PLL divide by 6
#define SYSCTL_AUXPLL_DIV_7        0x00000700U //!< Auxiliary PLL divide by 7

//! Macro to format Clock divider value. x is a number from 1 to 32.
//!
#define SYSCTL_AUXPLL_REFDIV(x)      SYSCTL_REFDIV((x))

//! Macro to format Clock divider value. x is a number from 1 to 32.
//!
#define SYSCTL_AUXPLL_ODIV(x)        SYSCTL_ODIV((x))


//
// Integer multiplier (IMULT)
//
//! Macro to format integer multiplier value. x is a number from 1 to 127.
//!
#define SYSCTL_AUXPLL_IMULT(x)      SYSCTL_IMULT((x))

//
// Fractional multiplier (FMULT)
//
#define SYSCTL_AUXPLL_FMULT_NONE  0x00000000U //!< No fractional multiplier
#define SYSCTL_AUXPLL_FMULT_0     0x00000000U //!< No fractional multiplier
#define SYSCTL_AUXPLL_FMULT_1_4   0x00004000U //!< Fractional multiplier - 0.25
#define SYSCTL_AUXPLL_FMULT_1_2   0x00008000U //!< Fractional multiplier - 0.50
#define SYSCTL_AUXPLL_FMULT_3_4   0x0000C000U //!< Fractional multiplier - 0.75

//
// Oscillator source
//
//! Internal oscillator INTOSC2 as auxiliary clock input
#define SYSCTL_AUXPLL_OSCSRC_OSC2       0x00000000U
//! External oscillator (XTAL) as auxiliary clock input
#define SYSCTL_AUXPLL_OSCSRC_XTAL       0x00010000U
//! AUXCLKIN (from GPIO) as auxiliary clock input
#define SYSCTL_AUXPLL_OSCSRC_AUXCLKIN   0x00020000U
//! External oscillator (XTAL) in single-ended mode
#define SYSCTL_AUXPLL_OSCSRC_XTAL_SE    0x00030000U

//
// Enable/disable PLL
//
#define SYSCTL_AUXPLL_ENABLE    0x80000000U //!< Enable AUXPLL
#define SYSCTL_AUXPLL_DISABLE   0x00000000U //!< Disable AUXPLL

//*****************************************************************************
//
// Values that can be passed to SysCtl_clearNMIStatus(),
// SysCtl_forceNMIFlags(), SysCtl_isNMIFlagSet(), and
// SysCtl_isNMIShadowFlagSet() as the nmiFlags parameter and returned by
// SysCtl_getNMIFlagStatus() and SysCtl_getNMIShadowFlagStatus().
//
//*****************************************************************************
#define SYSCTL_NMI_NMIINT           0x0001U //!< Non-maskable interrupt
#define SYSCTL_NMI_CLOCKFAIL        0x0002U //!< Clock Failure
#define SYSCTL_NMI_RAMUNCERR        0x0004U //!< Uncorrectable RAM error
#define SYSCTL_NMI_FLUNCERR         0x0008U //!< Uncorrectable Flash error
#define SYSCTL_NMI_CPU1HWBISTERR    0x0010U //!< HW BIST Error NMI Flag
#define SYSCTL_NMI_CPU2HWBISTERR    0x0020U //!<  HW BIST Error NMI Flag
#define SYSCTL_NMI_PIEVECTERR       0x0040U //!<  PIE Vector Fetch Error Flag
#define SYSCTL_NMI_ERADNMI          0x0080U //!<  ERAD Module NMI Flag
#define SYSCTL_NMI_CPU2WDRSN        0x0200U //!< CPU2 WDRSn Reset Indication
#define SYSCTL_NMI_CPU2NMIWDRSN     0x0400U //!< CPU2 NMIWDRSn Reset Indication
#define SYSCTL_NMI_CMNMIWDRSN       0x1000U //!< CM NMI watch dog has timed out
#define SYSCTL_NMI_ECATNMI          0x2000U //!< NMI from EtherCAT reset out
#define SYSCTL_NMI_CRC_FAIL         0x4000U //!< CRC calculation fail flag

//*****************************************************************************
//
// Values that can be passed to SysCtl_enableCMtoCPUNMI() &
// SysCtl_enableCMtoCPUInterrupt() as the Flags parameter
//
//*****************************************************************************

#define SYSCTL_FLAG_CMNMIWDRST       0x0004U //!< CM NMIWD Reset Indication

//*****************************************************************************
//
// Values that can be passed to/returned from SysCtl_getCMInterruptStatus()
// SysCtl_clearCMInterruptStatus() or SysCtl_setCMInterruptStatus()
// as the intFlags parameter
//
//*****************************************************************************
#define SYSCTL_STATUS_CMGINT          0x0001U //!< CM Global interrupt
#define SYSCTL_STATUS_CMNMIWDRST      0x0002U //!< CM NMIWD Interrupt
#define SYSCTL_STATUS_CMSYSRESETREQ   0x0004U //!< CM System Reset Interrupt
#define SYSCTL_STATUS_CMVECTRESET     0x0008U //!< CM Vector Reset Interrupt

//*****************************************************************************
//
// Values that can be passed to/returned from SysCtl_getInterruptStatus()
// SysCtl_clearInterruptStatus() or SysCtl_setInterruptStatus()
// as the intFlags parameter
//
//*****************************************************************************
#define SYSCTL_STATUS_GINT                   0x0001U //!< Global Interrupt flag
#define SYSCTL_STATUS_EMIF_ERR               0x0002U //!< EMIF error
#define SYSCTL_STATUS_RAM_CORRECTABLE_ERR    0x0004U //!< RAM correctable error
#define SYSCTL_STATUS_FLASH_CORRECTABLE_ERR  0x0008U //!< FLASH correctable err
#define SYSCTL_STATUS_RAM_ACC_VIOL           0x0010U //!< RAM access violation
#define SYSCTL_STATUS_SYS_PLL_SLIP           0x0020U //!< System PLL Slip event
#define SYSCTL_STATUS_AUX_PLL_SLIP           0x0040U //!< Auxillary PLL Slip
#define SYSCTL_STATUS_DCC0                   0x0080U //!< DCC0 Interrupt flag
#define SYSCTL_STATUS_DCC1                   0x0100U //!< DCC1 Interrupt flag
#define SYSCTL_STATUS_DCC2                   0x0200U //!< DCC2 Interrupt flag


//*****************************************************************************
//
// The following are values that can be passed to the SysCtl_clearResetCause()
// or SysCtl_simulateReset()
// API as rstCauses or returned by the SysCtl_getResetCause() API.
//
//*****************************************************************************
#define SYSCTL_CAUSE_POR                 0x00000001U //!< Power-on reset
#define SYSCTL_CAUSE_XRS                 0x00000002U //!< External reset pin
#define SYSCTL_CAUSE_WDRS                0x00000004U //!< Watchdog reset
#define SYSCTL_CAUSE_NMIWDRS             0x00000008U //!< NMI watchdog reset
#define SYSCTL_CAUSE_SCCRESET            0x00000100U //!< SCCRESETn by DCSM
#define SYSCTL_CAUSE_HWBISTN             0x00000020U //!< HWBISTn Reset
#define SYSCTL_CAUSE_ECAT_RESET_OUT      0x00000200U //!< ECAT_RESET_OUT Reset
#define SYSCTL_CAUSE_SIMRESET_CPU1RSN    0x00000400U //!< SIMRESET_CPU1 Reset
#define SYSCTL_CAUSE_SIMRESET_XRSN       0x00000800U //!< SIMRESET_XRSn Reset
#define SYSCTL_CAUSE_CPU1RSN             0x00000001U //!< Simulated CPU1Reset

//*****************************************************************************
//
// The following are one of the values that can be passed
// to the SysCtl_clearCPU2ResetStatus() API as rstCauses or returned
// by the SysCtl_getCPU2ResetStatus() API.
//
//*****************************************************************************
#define SYSCTL_RSTSTAT_CPU2HWBISTRST     0xCU

//*****************************************************************************
//
// The following values define the adcsocSrc parameter for
// SysCtl_enableExtADCSOCSource() and SysCtl_disableExtADCSOCSource().
//
//*****************************************************************************
//
// ADCSOCAO
//
#define SYSCTL_ADCSOC_SRC_PWM1SOCA    0x00000001U //!< ePWM1 SOCA for ADCSOCAO
#define SYSCTL_ADCSOC_SRC_PWM2SOCA    0x00000002U //!< ePWM2 SOCA for ADCSOCAO
#define SYSCTL_ADCSOC_SRC_PWM3SOCA    0x00000004U //!< ePWM3 SOCA for ADCSOCAO
#define SYSCTL_ADCSOC_SRC_PWM4SOCA    0x00000008U //!< ePWM4 SOCA for ADCSOCAO
#define SYSCTL_ADCSOC_SRC_PWM5SOCA    0x00000010U //!< ePWM5 SOCA for ADCSOCAO
#define SYSCTL_ADCSOC_SRC_PWM6SOCA    0x00000020U //!< ePWM6 SOCA for ADCSOCAO
#define SYSCTL_ADCSOC_SRC_PWM7SOCA    0x00000040U //!< ePWM7 SOCA for ADCSOCAO
#define SYSCTL_ADCSOC_SRC_PWM8SOCA    0x00000080U //!< ePWM8 SOCA for ADCSOCAO
#define SYSCTL_ADCSOC_SRC_PWM9SOCA    0x00000100U //!< ePWM9 SOCA for ADCSOCAO
#define SYSCTL_ADCSOC_SRC_PWM10SOCA   0x00000200U //!< ePWM10 SOCA for ADCSOCAO
#define SYSCTL_ADCSOC_SRC_PWM11SOCA   0x00000400U //!< ePWM11 SOCA for ADCSOCAO
#define SYSCTL_ADCSOC_SRC_PWM12SOCA   0x00000800U //!< ePWM12 SOCA for ADCSOCAO
#define SYSCTL_ADCSOC_SRC_PWM13SOCA   0x00001000U //!< ePWM13 SOCA for ADCSOCAO
#define SYSCTL_ADCSOC_SRC_PWM14SOCA   0x00002000U //!< ePWM14 SOCA for ADCSOCAO
#define SYSCTL_ADCSOC_SRC_PWM15SOCA   0x00004000U //!< ePWM15 SOCA for ADCSOCAO
#define SYSCTL_ADCSOC_SRC_PWM16SOCA   0x00008000U //!< ePWM16 SOCA for ADCSOCAO

//
// ADCSOCBO
//
#define SYSCTL_ADCSOC_SRC_PWM1SOCB    0x00010000U //!< ePWM1 SOCB for ADCSOCBO
#define SYSCTL_ADCSOC_SRC_PWM2SOCB    0x00020000U //!< ePWM2 SOCB for ADCSOCBO
#define SYSCTL_ADCSOC_SRC_PWM3SOCB    0x00040000U //!< ePWM3 SOCB for ADCSOCBO
#define SYSCTL_ADCSOC_SRC_PWM4SOCB    0x00080000U //!< ePWM4 SOCB for ADCSOCBO
#define SYSCTL_ADCSOC_SRC_PWM5SOCB    0x00100000U //!< ePWM5 SOCB for ADCSOCBO
#define SYSCTL_ADCSOC_SRC_PWM6SOCB    0x00200000U //!< ePWM6 SOCB for ADCSOCBO
#define SYSCTL_ADCSOC_SRC_PWM7SOCB    0x00400000U //!< ePWM7 SOCB for ADCSOCBO
#define SYSCTL_ADCSOC_SRC_PWM8SOCB    0x00800000U //!< ePWM8 SOCB for ADCSOCBO
#define SYSCTL_ADCSOC_SRC_PWM9SOCB    0x01000000U //!< ePWM9 SOCB for ADCSOCBO
#define SYSCTL_ADCSOC_SRC_PWM10SOCB   0x02000000U //!< ePWM10 SOCB for ADCSOCBO
#define SYSCTL_ADCSOC_SRC_PWM11SOCB   0x04000000U //!< ePWM11 SOCB for ADCSOCBO
#define SYSCTL_ADCSOC_SRC_PWM12SOCB   0x08000000U //!< ePWM12 SOCB for ADCSOCBO
#define SYSCTL_ADCSOC_SRC_PWM13SOCB   0x10000000U //!< ePWM13 SOCB for ADCSOCBO
#define SYSCTL_ADCSOC_SRC_PWM14SOCB   0x20000000U //!< ePWM14 SOCB for ADCSOCBO
#define SYSCTL_ADCSOC_SRC_PWM15SOCB   0x40000000U //!< ePWM15 SOCB for ADCSOCBO
#define SYSCTL_ADCSOC_SRC_PWM16SOCB   0x80000000U //!< ePWM16 SOCB for ADCSOCBO
#endif

//*****************************************************************************
//
//! The following are values that can be passed to SysCtl_enablePeripheral()
//! and SysCtl_disablePeripheral() as the \e peripheral parameter.
//
//*****************************************************************************
typedef enum
{
    //
    // PCLKCR0
    //
    SYSCTL_PERIPH_CLK_CLA1       = 0x0000,  //!< CLA1 clock
    SYSCTL_PERIPH_CLK_DMA        = 0x0200,  //!< DMA clock
    SYSCTL_PERIPH_CLK_TIMER0     = 0x0300,  //!< CPUTIMER0 clock
    SYSCTL_PERIPH_CLK_TIMER1     = 0x0400,  //!< CPUTIMER1 clock
    SYSCTL_PERIPH_CLK_TIMER2     = 0x0500,  //!< CPUTIMER2 clock
    SYSCTL_PERIPH_CLK_CPUBGCRC   = 0x0D00,  //!< CPUBGCRC clock
    SYSCTL_PERIPH_CLK_CLA1BGCRC  = 0x0E00,  //!< CLA1BGCRC clock
    SYSCTL_PERIPH_CLK_HRCAL      = 0x1000,  //!< HRPWM clock
    SYSCTL_PERIPH_CLK_TBCLKSYNC  = 0x1200,  //!< ePWM time base clock sync
    SYSCTL_PERIPH_CLK_GTBCLKSYNC = 0x1300,  //!< ePWM global time base sync
    SYSCTL_PERIPH_CLK_ERAD       = 0x1800,  //!<  ERAD module clock

    //
    // PCLKCR1
    //
    SYSCTL_PERIPH_CLK_EMIF1      = 0x0001,  //!< EMIF1 clock
    SYSCTL_PERIPH_CLK_EMIF2      = 0x0101,  //!< EMIF2 clock

    //
    // PCLKCR2
    //
    SYSCTL_PERIPH_CLK_EPWM1      = 0x0002,  //!< ePWM1 clock
    SYSCTL_PERIPH_CLK_EPWM2      = 0x0102,  //!< ePWM2 clock
    SYSCTL_PERIPH_CLK_EPWM3      = 0x0202,  //!< ePWM3 clock
    SYSCTL_PERIPH_CLK_EPWM4      = 0x0302,  //!< ePWM4 clock
    SYSCTL_PERIPH_CLK_EPWM5      = 0x0402,  //!< ePWM5 clock
    SYSCTL_PERIPH_CLK_EPWM6      = 0x0502,  //!< ePWM6 clock
    SYSCTL_PERIPH_CLK_EPWM7      = 0x0602,  //!< ePWM7 clock
    SYSCTL_PERIPH_CLK_EPWM8      = 0x0702,  //!< ePWM8 clock
    SYSCTL_PERIPH_CLK_EPWM9      = 0x0802,  //!< ePWM9 clock
    SYSCTL_PERIPH_CLK_EPWM10     = 0x0902,  //!< ePWM10 clock
    SYSCTL_PERIPH_CLK_EPWM11     = 0x0A02,  //!< ePWM11 clock
    SYSCTL_PERIPH_CLK_EPWM12     = 0x0B02,  //!< ePWM12 clock
    SYSCTL_PERIPH_CLK_EPWM13     = 0x0C02,  //!< ePWM13 clock
    SYSCTL_PERIPH_CLK_EPWM14     = 0x0D02,  //!< ePWM14 clock
    SYSCTL_PERIPH_CLK_EPWM15     = 0x0E02,  //!< ePWM15 clock
    SYSCTL_PERIPH_CLK_EPWM16     = 0x0F02,  //!< ePWM16 clock

    //
    // PCLKCR3
    //
    SYSCTL_PERIPH_CLK_ECAP1      = 0x0003,  //!< eCAP1 clock
    SYSCTL_PERIPH_CLK_ECAP2      = 0x0103,  //!< eCAP2 clock
    SYSCTL_PERIPH_CLK_ECAP3      = 0x0203,  //!< eCAP3 clock
    SYSCTL_PERIPH_CLK_ECAP4      = 0x0303,  //!< eCAP4 clock
    SYSCTL_PERIPH_CLK_ECAP5      = 0x0403,  //!< eCAP5 clock
    SYSCTL_PERIPH_CLK_ECAP6      = 0x0503,  //!< eCAP6 clock
    SYSCTL_PERIPH_CLK_ECAP7      = 0x0603,  //!< eCAP7 clock

    //
    // PCLKCR4
    //
    SYSCTL_PERIPH_CLK_EQEP1      = 0x0004,  //!< eQEP1 clock
    SYSCTL_PERIPH_CLK_EQEP2      = 0x0104,  //!< eQEP2 clock
    SYSCTL_PERIPH_CLK_EQEP3      = 0x0204,  //!< eQEP3 clock

    //
    // PCLKCR5
    //
    // Reserved

    //
    // PCLKCR6
    //
    SYSCTL_PERIPH_CLK_SD1        = 0x0006,  //!< SDFM1 clock
    SYSCTL_PERIPH_CLK_SD2        = 0x0106,  //!< SDFM2 clock

    //
    // PCLKCR7
    //
    SYSCTL_PERIPH_CLK_SCIA       = 0x0007,  //!< SCIA clock
    SYSCTL_PERIPH_CLK_SCIB       = 0x0107,  //!< SCIB clock
    SYSCTL_PERIPH_CLK_SCIC       = 0x0207,  //!< SCIC clock
    SYSCTL_PERIPH_CLK_SCID       = 0x0307,  //!< SCID clock

    //
    // PCLKCR8
    //
    SYSCTL_PERIPH_CLK_SPIA       = 0x0008,  //!< SPIA clock
    SYSCTL_PERIPH_CLK_SPIB       = 0x0108,  //!< SPIB clock
    SYSCTL_PERIPH_CLK_SPIC       = 0x0208,  //!< SPIC clock
    SYSCTL_PERIPH_CLK_SPID       = 0x0308,  //!< SPID clock

    //
    // PCLKCR9
    //
    SYSCTL_PERIPH_CLK_I2CA       = 0x0009,  //!< I2CA clock
    SYSCTL_PERIPH_CLK_I2CB       = 0x0109,  //!< I2CB clock

    //
    // PCLKCR10
    //
    SYSCTL_PERIPH_CLK_CANA       = 0x000A,  //!< CANA clock
    SYSCTL_PERIPH_CLK_CANB       = 0x010A,  //!< CANB clock

    //
    // PCLKCR11
    //
    SYSCTL_PERIPH_CLK_MCBSPA     = 0x000B,  //!< McBSPA clock
    SYSCTL_PERIPH_CLK_MCBSPB     = 0x010B,  //!< McBSPB clock
    SYSCTL_PERIPH_CLK_USBA       = 0x100B,  //!< USBA clock

    //
    // PCLKCR12
    //

    //
    // PCLKCR13
    //
    SYSCTL_PERIPH_CLK_ADCA       = 0x000D,  //!< ADCA clock
    SYSCTL_PERIPH_CLK_ADCB       = 0x010D,  //!< ADCB clock
    SYSCTL_PERIPH_CLK_ADCC       = 0x020D,  //!< ADCC clock
    SYSCTL_PERIPH_CLK_ADCD       = 0x030D,  //!< ADCD clock

    //
    // PCLKCR14
    //
    SYSCTL_PERIPH_CLK_CMPSS1     = 0x000E,  //!< CMPSS1 clock
    SYSCTL_PERIPH_CLK_CMPSS2     = 0x010E,  //!< CMPSS2 clock
    SYSCTL_PERIPH_CLK_CMPSS3     = 0x020E,  //!< CMPSS3 clock
    SYSCTL_PERIPH_CLK_CMPSS4     = 0x030E,  //!< CMPSS4 clock
    SYSCTL_PERIPH_CLK_CMPSS5     = 0x040E,  //!< CMPSS5 clock
    SYSCTL_PERIPH_CLK_CMPSS6     = 0x050E,  //!< CMPSS6 clock
    SYSCTL_PERIPH_CLK_CMPSS7     = 0x060E,  //!< CMPSS7 clock
    SYSCTL_PERIPH_CLK_CMPSS8     = 0x070E,  //!< CMPSS8 clock

    //
    // PCLKCR15
    //
    // Reserved

    //
    // PCLKCR16
    //
    SYSCTL_PERIPH_CLK_DACA       = 0x1010,  //!< DACA clock
    SYSCTL_PERIPH_CLK_DACB       = 0x1110,  //!< DACB clock
    SYSCTL_PERIPH_CLK_DACC       = 0x1210,  //!< DACC clock

    //
    // PCLKCR17
    //

    //
    // PCLKCR18
    //
    SYSCTL_PERIPH_CLK_FSITXA     = 0x0012,  //!< FSITXA clock
    SYSCTL_PERIPH_CLK_FSITXB     = 0x0112,  //!< FSITXB clock
    SYSCTL_PERIPH_CLK_FSIRXA     = 0x1012,  //!< FSIRXA clock
    SYSCTL_PERIPH_CLK_FSIRXB     = 0x1112,  //!< FSIRXB clock
    SYSCTL_PERIPH_CLK_FSIRXC     = 0x1212,  //!< FSIRXC clock
    SYSCTL_PERIPH_CLK_FSIRXD     = 0x1312,  //!< FSIRXD clock
    SYSCTL_PERIPH_CLK_FSIRXE     = 0x1412,  //!< FSIRXE clock
    SYSCTL_PERIPH_CLK_FSIRXF     = 0x1512,  //!< FSIRXF clock
    SYSCTL_PERIPH_CLK_FSIRXG     = 0x1612,  //!< FSIRXG clock
    SYSCTL_PERIPH_CLK_FSIRXH     = 0x1712,  //!< FSIRXH clock

    //
    // PCLKCR19
    //
    // Reserved

    //
    // PCLKCR20
    //
    SYSCTL_PERIPH_CLK_PMBUSA     = 0x0014,  //!< PMBusA clock

    //
    // PCLKCR21
    //
    SYSCTL_PERIPH_CLK_DCC0       = 0x0015,  //!< DCC0 clock
    SYSCTL_PERIPH_CLK_DCC1       = 0x0115,  //!< DCC1 clock
    SYSCTL_PERIPH_CLK_DCC2       = 0x0215,  //!< DCC2 clock


    //
    // PCLKCR23
    //
    SYSCTL_PERIPH_CLK_ECAT       = 0x0017   //!< Ethercat clock
} SysCtl_PeripheralPCLOCKCR;
//*****************************************************************************
//
//! The following are values that can be passed to SysCtl_resetPeripheral() as
//! the \e peripheral parameter.
//
//*****************************************************************************
typedef enum
{
    // SOFTPRES0
    SYSCTL_PERIPH_RES_CPU1_CLA1  = 0x0000,  //!< Reset CPU1 CLA1
    SYSCTL_PERIPH_RES_CPU2_CLA1  = 0x0200,  //!< Reset CPU2 CLA1
    SYSCTL_PERIPH_RES_CPUBGCRC   = 0x0D00,  //!< Reset CPUBGCRC
    SYSCTL_PERIPH_RES_CLA1BGCRC  = 0x0E00,  //!< Reset CLA1BGCRC
    SYSCTL_PERIPH_RES_ERAD       = 0x1800,  //!< Reset ERAD

    // SOFTPRES1
    SYSCTL_PERIPH_RES_EMIF1      = 0x0001,  //!< Reset EMIF1
    SYSCTL_PERIPH_RES_EMIF2      = 0x0101,  //!< Reset EMIF2

    // SOFTPRES2
    SYSCTL_PERIPH_RES_EPWM1      = 0x0002,  //!< Reset ePWM1
    SYSCTL_PERIPH_RES_EPWM2      = 0x0102,  //!< Reset ePWM2
    SYSCTL_PERIPH_RES_EPWM3      = 0x0202,  //!< Reset ePWM3
    SYSCTL_PERIPH_RES_EPWM4      = 0x0302,  //!< Reset ePWM4
    SYSCTL_PERIPH_RES_EPWM5      = 0x0402,  //!< Reset ePWM5
    SYSCTL_PERIPH_RES_EPWM6      = 0x0502,  //!< Reset ePWM6
    SYSCTL_PERIPH_RES_EPWM7      = 0x0602,  //!< Reset ePWM7
    SYSCTL_PERIPH_RES_EPWM8      = 0x0702,  //!< Reset ePWM8
    SYSCTL_PERIPH_RES_EPWM9      = 0x0802,  //!< Reset ePWM9
    SYSCTL_PERIPH_RES_EPWM10     = 0x0902,  //!< Reset ePWM10
    SYSCTL_PERIPH_RES_EPWM11     = 0x0A02,  //!< Reset ePWM11
    SYSCTL_PERIPH_RES_EPWM12     = 0x0B02,  //!< Reset ePWM12
    SYSCTL_PERIPH_RES_EPWM13     = 0x0C02,  //!< Reset ePWM13
    SYSCTL_PERIPH_RES_EPWM14     = 0x0D02,  //!< Reset ePWM14
    SYSCTL_PERIPH_RES_EPWM15     = 0x0E02,  //!< Reset ePWM15
    SYSCTL_PERIPH_RES_EPWM16     = 0x0F02,  //!< Reset ePWM16

    // SOFTPRES3
    SYSCTL_PERIPH_RES_ECAP1      = 0x0003,  //!< Reset eCAP1
    SYSCTL_PERIPH_RES_ECAP2      = 0x0103,  //!< Reset eCAP2
    SYSCTL_PERIPH_RES_ECAP3      = 0x0203,  //!< Reset eCAP3
    SYSCTL_PERIPH_RES_ECAP4      = 0x0303,  //!< Reset eCAP4
    SYSCTL_PERIPH_RES_ECAP5      = 0x0403,  //!< Reset eCAP5
    SYSCTL_PERIPH_RES_ECAP6      = 0x0503,  //!< Reset eCAP6
    SYSCTL_PERIPH_RES_ECAP7      = 0x0603,  //!< Reset eCAP7

