yahalit/Ilia/Sw3/BolshoyManipCpu2R3/F2838x_driverlib/driverlib/sysctl.h
    // CMPSS
    SYSCTL_ACCESS_CMPSS1          = 0x10,   //!< CMPSS1 access
    SYSCTL_ACCESS_CMPSS2          = 0x12,   //!< CMPSS2 access
    SYSCTL_ACCESS_CMPSS3          = 0x14,   //!< CMPSS3 access
    SYSCTL_ACCESS_CMPSS4          = 0x16,   //!< CMPSS4 access
    SYSCTL_ACCESS_CMPSS5          = 0x18,   //!< CMPSS5 access
    SYSCTL_ACCESS_CMPSS6          = 0x1A,   //!< CMPSS6 access
    SYSCTL_ACCESS_CMPSS7          = 0x1C,   //!< CMPSS7 access
    SYSCTL_ACCESS_CMPSS8          = 0x1E,   //!< CMPSS8 access

    // DAC
    SYSCTL_ACCESS_DACA            = 0x28,   //!< DACA access
    SYSCTL_ACCESS_DACB            = 0x2A,   //!< DACB access
    SYSCTL_ACCESS_DACC            = 0x2C,   //!< DACC access


    // EPWM
    SYSCTL_ACCESS_EPWM1           = 0x48,   //!< ePWM1 access
    SYSCTL_ACCESS_EPWM2           = 0x4A,   //!< ePWM2 access
    SYSCTL_ACCESS_EPWM3           = 0x4C,   //!< ePWM3 access
    SYSCTL_ACCESS_EPWM4           = 0x4E,   //!< ePWM4 access
    SYSCTL_ACCESS_EPWM5           = 0x50,   //!< ePWM5 access
    SYSCTL_ACCESS_EPWM6           = 0x52,   //!< ePWM6 access
    SYSCTL_ACCESS_EPWM7           = 0x54,   //!< ePWM7 access
    SYSCTL_ACCESS_EPWM8           = 0x56,   //!< ePWM8 access
    SYSCTL_ACCESS_EPWM9           = 0x58,   //!< ePWM9 access
    SYSCTL_ACCESS_EPWM10          = 0x5A,   //!< ePWM10 access
    SYSCTL_ACCESS_EPWM11          = 0x5C,   //!< ePWM11 access
    SYSCTL_ACCESS_EPWM12          = 0x5E,   //!< ePWM12 access
    SYSCTL_ACCESS_EPWM13          = 0x60,   //!< ePWM13 access
    SYSCTL_ACCESS_EPWM14          = 0x62,   //!< ePWM14 access
    SYSCTL_ACCESS_EPWM15          = 0x64,   //!< ePWM15 access
    SYSCTL_ACCESS_EPWM16          = 0x66,   //!< ePWM16 access

    // EQEP
    SYSCTL_ACCESS_EQEP1           = 0x70,   //!< eQEP1 access
    SYSCTL_ACCESS_EQEP2           = 0x72,   //!< eQEP2 access
    SYSCTL_ACCESS_EQEP3           = 0x74,   //!< eQEP3 access

    // ECAP
    SYSCTL_ACCESS_ECAP1           = 0x80,   //!< eCAP1 access
    SYSCTL_ACCESS_ECAP2           = 0x82,   //!< eCAP2 access
    SYSCTL_ACCESS_ECAP3           = 0x84,   //!< eCAP3 access
    SYSCTL_ACCESS_ECAP4           = 0x86,   //!< eCAP4 access
    SYSCTL_ACCESS_ECAP5           = 0x88,   //!< eCAP5 access
    SYSCTL_ACCESS_ECAP6           = 0x8A,   //!< eCAP6 access
    SYSCTL_ACCESS_ECAP7           = 0x8C,   //!< eCAP7 access

    // SDFM
    SYSCTL_ACCESS_SDFM1           = 0xA8,   //!< SDFM1 access
    SYSCTL_ACCESS_SDFM2           = 0xAA,   //!< SDFM2 access



    // SPI
    SYSCTL_ACCESS_SPIA            = 0x110,  //!< SPIA access
    SYSCTL_ACCESS_SPIB            = 0x112,  //!< SPIB access
    SYSCTL_ACCESS_SPIC            = 0x114,  //!< SPIC access
    SYSCTL_ACCESS_SPID            = 0x116,  //!< SPID access

    // PMBUS
    SYSCTL_ACCESS_PMBUS_A         = 0x130,  //!< PMBusA access

    // CAN
    SYSCTL_ACCESS_CANA            = 0x140,  //!< CANA access
    SYSCTL_ACCESS_CANB            = 0x142,  //!< CANB access
    // MCBSP
    SYSCTL_ACCESS_MCBSPA          = 0x150,  //!< MCBSPA access
    SYSCTL_ACCESS_MCBSPB          = 0x152,  //!< MCBSPB access

    // USBA
    SYSCTL_ACCESS_USBA            = 0x180,  //!< USBA access
    // HRPWM
    SYSCTL_ACCESS_HRPWM_A         = 0x1A8,  //!< HRPWM access

    // ECAT
    SYSCTL_ACCESS_ECAT            = 0x1AA,  //!< ECAT access

    // FSI
    SYSCTL_ACCESS_FSIATX          = 0x1B0,  //!< FSITXA access
    SYSCTL_ACCESS_FSIARX          = 0x1B2,  //!< FSIRXA access
    SYSCTL_ACCESS_FSIBTX          = 0x1B4,  //!< FSITXB access
    SYSCTL_ACCESS_FSIBRX          = 0x1B6,  //!< FSIRXB access
    SYSCTL_ACCESS_FSICRX          = 0x1BA,  //!< FSIRXC access
    SYSCTL_ACCESS_FSIDRX          = 0x1BE,  //!< FSIRXD access
    SYSCTL_ACCESS_FSIERX          = 0x1C2,  //!< FSIRXE access
    SYSCTL_ACCESS_FSIFRX          = 0x1C6,  //!< FSIRXF access
    SYSCTL_ACCESS_FSIGRX          = 0x1CA,  //!< FSIRXG access
    SYSCTL_ACCESS_FSIHRX          = 0x1CE   //!< FSIRXH access
} SysCtl_AccessPeripheral;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setPeripheralAccessControl() and SysCtl_getPeripheralAccessControl()
//! as the \e master parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_ACCESS_CPUX  = 0U,   //!< CPU access to the peripheral
    SYSCTL_ACCESS_CLA1  = 2U,   //!< CLA1 access to the peripheral
    SYSCTL_ACCESS_DMA1  = 4U    //!< DMA access to the peripheral
} SysCtl_AccessMaster;
//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setPeripheralAccessControl() as the \e permission parameter.
//
//*****************************************************************************
typedef enum
{
    //! Full Access for both read and write.
    SYSCTL_ACCESS_FULL      = 3U,
    //! Protected RD access such that FIFOs. Clear on read, registers are not
    //! changed and no write access.
    SYSCTL_ACCESS_PROTECTED = 2U,
    //! No read or write access.
    SYSCTL_ACCESS_NONE      = 0U
} SysCtl_AccessPermission;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_selectClockOutSource() as the \e source parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_CLOCKOUT_PLLSYS     = 0U,   //!< PLL System Clock post SYSCLKDIV
    SYSCTL_CLOCKOUT_PLLRAW     = 1U,   //!< PLL Raw Clock
    SYSCTL_CLOCKOUT_SYSCLK     = 2U,   //!< CPU System Clock
    SYSCTL_CLOCKOUT_SYSCLK2    = 3U,   //!< CPU 2 System Clock
    SYSCTL_CLOCKOUT_AUXPLLCLK  = 4U,   //!< Aux PLL Clock
    SYSCTL_CLOCKOUT_INTOSC1    = 5U,   //!< Internal Oscillator 1
    SYSCTL_CLOCKOUT_INTOSC2    = 6U,   //!< Internal Oscillator 2
    SYSCTL_CLOCKOUT_XTALOSC    = 7U,   //!< External Oscillator
    SYSCTL_CLOCKOUT_CMCLK      = 8U,   //!< CMCLK
    SYSCTL_CLOCKOUT_PUMPOSC    = 9U,   //!< PUMPOSC
    SYSCTL_SYSPLLCLK_AUX       = 10U,  //!< Test Clk of the System APLL
    SYSCTL_AUXPLLCLK_AUX       = 11U,  //!< Test Clk of the Auxillary APLL
    SYSCTL_SYSPLLCLKOUT        = 12U,  //!< PLL System Clock pre SYSCLKDIV
    SYSCTL_AUXPLLCLKOUT        = 13U   //!< PLL System Clock pre AUXCLKDIV
} SysCtl_ClockOut;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setExternalOscMode() as the \e mode parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_XTALMODE_CRYSTAL = 1U,   //!< XTAL Oscillator Crystal Mode
    SYSCTL_XTALMODE_SINGLE  = 2U    //!< XTAL Oscillator Single-Ended Mode
} SysCtl_ExternalOscMode;


//*****************************************************************************
//
//! The following values define the \e syncSrc parameter for
//! SysCtl_setSyncOutputConfig().
//
//*****************************************************************************
typedef enum
{
  SYSCTL_SYNC_OUT_SRC_EPWM1SYNCOUT  = 0X0U,  //!< EPWM1SYNCOUT --> EXTSYNCOUT
  SYSCTL_SYNC_OUT_SRC_EPWM2SYNCOUT  = 0X1U,  //!< EPWM2SYNCOUT --> EXTSYNCOUT
  SYSCTL_SYNC_OUT_SRC_EPWM3SYNCOUT  = 0X2U,  //!< EPWM3SYNCOUT --> EXTSYNCOUT
  SYSCTL_SYNC_OUT_SRC_EPWM4SYNCOUT  = 0X3U,  //!< EPWM4SYNCOUT --> EXTSYNCOUT
  SYSCTL_SYNC_OUT_SRC_EPWM5SYNCOUT  = 0X4U,  //!< EPWM5SYNCOUT --> EXTSYNCOUT
  SYSCTL_SYNC_OUT_SRC_EPWM6SYNCOUT  = 0X5U,  //!< EPWM6SYNCOUT --> EXTSYNCOUT
  SYSCTL_SYNC_OUT_SRC_EPWM7SYNCOUT  = 0X6U,  //!< EPWM7SYNCOUT --> EXTSYNCOUT
  SYSCTL_SYNC_OUT_SRC_EPWM8SYNCOUT  = 0X7U,  //!< EPWM8SYNCOUT --> EXTSYNCOUT
  SYSCTL_SYNC_OUT_SRC_EPWM9SYNCOUT  = 0X8U,  //!< EPWM9SYNCOUT --> EXTSYNCOUT
  SYSCTL_SYNC_OUT_SRC_EPWM10SYNCOUT = 0X9U,  //!< EPWM10SYNCOUT --> EXTSYNCOUT
  SYSCTL_SYNC_OUT_SRC_EPWM11SYNCOUT = 0XAU,  //!< EPWM11SYNCOUT --> EXTSYNCOUT
  SYSCTL_SYNC_OUT_SRC_EPWM12SYNCOUT = 0XBU,  //!< EPWM12SYNCOUT --> EXTSYNCOUT
  SYSCTL_SYNC_OUT_SRC_EPWM13SYNCOUT = 0XCU,  //!< EPWM13SYNCOUT --> EXTSYNCOUT
  SYSCTL_SYNC_OUT_SRC_EPWM14SYNCOUT = 0XDU,  //!< EPWM14SYNCOUT --> EXTSYNCOUT
  SYSCTL_SYNC_OUT_SRC_EPWM15SYNCOUT = 0XEU,  //!< EPWM15SYNCOUT --> EXTSYNCOUT
  SYSCTL_SYNC_OUT_SRC_EPWM16SYNCOUT = 0XFU,  //!< EPWM16SYNCOUT --> EXTSYNCOUT
  SYSCTL_SYNC_OUT_SRC_ECAP1SYNCOUT  = 0x18,  //!< ECAP1SYNCOUT --> EXTSYNCOUT
  SYSCTL_SYNC_OUT_SRC_ECAP2SYNCOUT  = 0x19,  //!< ECAP2SYNCOUT --> EXTSYNCOUT
  SYSCTL_SYNC_OUT_SRC_ECAP3SYNCOUT  = 0x20,  //!< ECAP3SYNCOUT --> EXTSYNCOUT
  SYSCTL_SYNC_OUT_SRC_ECAP4SYNCOUT  = 0x21,  //!< ECAP4SYNCOUT --> EXTSYNCOUT
  SYSCTL_SYNC_OUT_SRC_ECAP5SYNCOUT  = 0x22,  //!< ECAP5SYNCOUT --> EXTSYNCOUT
  SYSCTL_SYNC_OUT_SRC_ECAP6SYNCOUT  = 0x23,  //!< ECAP6SYNCOUT --> EXTSYNCOUT
  SYSCTL_SYNC_OUT_SRC_ECAP7SYNCOUT  = 0x24   //!< ECAP7SYNCOUT --> EXTSYNCOUT

} SysCtl_SyncOutputSource;

//*****************************************************************************
//
//! The following values define the \e parametric parameter for
//! SysCtl_getDeviceParametric().
//
//*****************************************************************************
typedef enum
{
    SYSCTL_DEVICE_QUAL,       //!< Device Qualification Status
    SYSCTL_DEVICE_PINCOUNT,   //!< Device Pin Count
    SYSCTL_DEVICE_INSTASPIN,  //!< Device InstaSPIN Feature Set
    SYSCTL_DEVICE_FLASH,      //!< Device Flash size (KB)
    SYSCTL_DEVICE_PARTID,     //!< Device Part ID Format Revision
    SYSCTL_DEVICE_FAMILY,     //!< Device Family
    SYSCTL_DEVICE_PARTNO,     //!< Device Part Number
    SYSCTL_DEVICE_CLASSID     //!< Device Class ID
} SysCtl_DeviceParametric;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_lockConfigRegs() as the \e master parameter.
//
//*****************************************************************************
typedef enum
{
  SYSCTL_DC_PERCNF_PARTID, //!< Allows/Blocks write to Device config registers
  SYSCTL_BANKSEL           //!< Allows/Blocks write to BANKSEL registers

}SysCtl_DeviceConf;

//*****************************************************************************
//
//! The following are values that can be passed to SysCtl_controlCMReset() &
//! SysCtl_CPU2Reset() as the \e master parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_CORE_DEACTIVE,   //!< Core reset is deactivated
    SYSCTL_CORE_ACTIVE      //!< Core is held in reset

}SysCtl_CoreReset;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_readADCWrapper as the \e peripheral parameter.
//
//*****************************************************************************
typedef enum
{
    // ADC
    SYSCTL_SELECT_ADCA,    //!< ADCA access
    SYSCTL_SELECT_ADCB,    //!< ADCB access
    SYSCTL_SELECT_ADCC,    //!< ADCC access
    SYSCTL_SELECT_ADCD     //!< ADCD access

}SysCtl_SelADC;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_selectbank() as the \e prescaler parameter.
//
//*****************************************************************************
typedef enum
{
    //! CPU1BANK
    SYSCTL_CPU1BANK,
    //! CPU2BANK (CPU1BANK in read mode)
    SYSCTL_CPU2BANK,
    //! CMBANK   (CPU1BANK in read mode)
    SYSCTL_CMBANK

}SysCtl_CPUBank;

//*****************************************************************************
//
//! The following are values that can be passed to SysCtl_configureType()
//! as the \e peripheral parameter.
//
//*****************************************************************************
typedef enum
{
    //!Configure USB Type for the device
    SYSCTL_USBTYPE = 0x0,
    //!Configure ECAP Type for the device
    SYSCTL_ECAPTYPE = 0x1,
    //!Configure SDFM Type for the device
    SYSCTL_SDFMTYPE = 0x2,
    //! Configure MEMMAP Type for the device
    SYSCTL_MEMMAPTYPE = 0x4

