yahalit/Ilia/Sw3/BolshoyManipCpu2R3/F2838x_driverlib/driverlib/sysctl.h
}SysCtl_SelType;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_allocateSharedPeripheral() as the \e peripheral parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_PALLOCATE_USBA,     //!< Allocate USB_A to CM
    SYSCTL_PALLOCATE_ETHERCAT, //!< Allocate ETHERCAT to CM
    SYSCTL_PALLOCATE_CAN_A,    //!< Allocate CAN_A to CM
    SYSCTL_PALLOCATE_CAN_B    //!< Allocate CAN_B to CM

}SysCtl_SharedPeripheral;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setXClk() as \e divider parameter.
//
//*****************************************************************************
typedef enum
{
  SYSCTL_XCLKOUT_DIV_1,      //!<  XCLKOUT =  XCLKOUT / 1
  SYSCTL_XCLKOUT_DIV_2,      //!<  XCLKOUT =  XCLKOUT / 2
  SYSCTL_XCLKOUT_DIV_4,      //!<  XCLKOUT =  XCLKOUT / 4
  SYSCTL_XCLKOUT_DIV_8       //!<  XCLKOUT =  XCLKOUT / 8

}SysCtl_XClkDivider;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setCMClk() as \e divider parameter.
//
//*****************************************************************************
typedef enum
{
  SYSCTL_CMCLKOUT_DIV_1,      //!<  CM clock =  CM clock / 1
  SYSCTL_CMCLKOUT_DIV_2,      //!<  CM clock =  CM clock / 2
  SYSCTL_CMCLKOUT_DIV_3,      //!<  CM clock =  CM clock / 3
  SYSCTL_CMCLKOUT_DIV_4,      //!<  CM clock =  CM clock / 4
  SYSCTL_CMCLKOUT_DIV_5,      //!<  CM clock =  CM clock / 5
  SYSCTL_CMCLKOUT_DIV_6,      //!<  CM clock =  CM clock / 6
  SYSCTL_CMCLKOUT_DIV_7,      //!<  CM clock =  CM clock / 7
  SYSCTL_CMCLKOUT_DIV_8       //!<  CM clock =  CM clock / 8

}SysCtl_CMClkDivider;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setECatClk() as \e divider parameter.
//
//*****************************************************************************
typedef enum
{
  SYSCTL_ECATCLKOUT_DIV_1,      //!<  ECat clock =  ECat clock / 1
  SYSCTL_ECATCLKOUT_DIV_2,      //!<  ECat clock =  ECat clock / 2
  SYSCTL_ECATCLKOUT_DIV_3,      //!<  ECat clock =  ECat clock / 3
  SYSCTL_ECATCLKOUT_DIV_4,      //!<  ECat clock =  ECat clock / 4
  SYSCTL_ECATCLKOUT_DIV_5,      //!<  ECat clock =  ECat clock / 5
  SYSCTL_ECATCLKOUT_DIV_6,      //!<  ECat clock =  ECat clock / 6
  SYSCTL_ECATCLKOUT_DIV_7,      //!<  ECat clock =  ECat clock / 7
  SYSCTL_ECATCLKOUT_DIV_8       //!<  ECat clock =  ECat clock / 8

}SysCtl_ECatClkDivider;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setEnetClk() as \e divider parameter.
//
//*****************************************************************************
typedef enum
{
  SYSCTL_ENETCLKOUT_DIV_1,      //!<  Enet clock =  Enet clock / 1
  SYSCTL_ENETCLKOUT_DIV_2,      //!<  Enet clock =  Enet clock / 2
  SYSCTL_ENETCLKOUT_DIV_3,      //!<  Enet clock =  Enet clock / 3
  SYSCTL_ENETCLKOUT_DIV_4,      //!<  Enet clock =  Enet clock / 4
  SYSCTL_ENETCLKOUT_DIV_5,      //!<  Enet clock =  Enet clock / 5
  SYSCTL_ENETCLKOUT_DIV_6,      //!<  Enet clock =  Enet clock / 6
  SYSCTL_ENETCLKOUT_DIV_7,      //!<  Enet clock =  Enet clock / 7
  SYSCTL_ENETCLKOUT_DIV_8       //!<  Enet clock =  Enet clock / 8

}SysCtl_EnetClkDivider;

//*****************************************************************************
//
//! The following are values that can be passed to SysCtl_setCMClk(),
//! SysCtl_setECatClk() & SysCtl_isPLLValid() as \e source parameter.
//
//*****************************************************************************
typedef enum
{
  //! Auxillary PLL
  SYSCTL_SOURCE_AUXPLL,
  //! System PLL
  SYSCTL_SOURCE_SYSPLL

}SysCtl_PLLClockSource;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setMCANClk() as \e divider parameter.
//
//*****************************************************************************
typedef enum
{
  SYSCTL_MCANCLK_DIV_1  = 0x0,   //!<  MCAN clock =  MCAN clock / 1
  SYSCTL_MCANCLK_DIV_2  = 0x1,   //!<  MCAN clock =  MCAN clock / 2
  SYSCTL_MCANCLK_DIV_3  = 0x2,   //!<  MCAN clock =  MCAN clock / 3
  SYSCTL_MCANCLK_DIV_4  = 0x3,   //!<  MCAN clock =  MCAN clock / 4
  SYSCTL_MCANCLK_DIV_5  = 0x4,   //!<  MCAN clock =  MCAN clock / 5
  SYSCTL_MCANCLK_DIV_6  = 0x5,   //!<  MCAN clock =  MCAN clock / 6
  SYSCTL_MCANCLK_DIV_7  = 0x6,   //!<  MCAN clock =  MCAN clock / 7
  SYSCTL_MCANCLK_DIV_8  = 0x7,   //!<  MCAN clock =  MCAN clock / 8
  SYSCTL_MCANCLK_DIV_9  = 0x8,   //!<  MCAN clock =  MCAN clock / 9
  SYSCTL_MCANCLK_DIV_10 = 0x9,   //!<  MCAN clock =  MCAN clock / 10
  SYSCTL_MCANCLK_DIV_11 = 0xA,   //!<  MCAN clock =  MCAN clock / 11
  SYSCTL_MCANCLK_DIV_12 = 0xB,   //!<  MCAN clock =  MCAN clock / 12
  SYSCTL_MCANCLK_DIV_13 = 0xC,   //!<  MCAN clock =  MCAN clock / 13
  SYSCTL_MCANCLK_DIV_14 = 0xD,   //!<  MCAN clock =  MCAN clock / 14
  SYSCTL_MCANCLK_DIV_15 = 0xE,   //!<  MCAN clock =  MCAN clock / 15
  SYSCTL_MCANCLK_DIV_16 = 0xF,   //!<  MCAN clock =  MCAN clock / 16
  SYSCTL_MCANCLK_DIV_17 = 0x10,  //!<  MCAN clock =  MCAN clock / 17
  SYSCTL_MCANCLK_DIV_18 = 0x11,  //!<  MCAN clock =  MCAN clock / 18
  SYSCTL_MCANCLK_DIV_19 = 0x12,  //!<  MCAN clock =  MCAN clock / 19
  SYSCTL_MCANCLK_DIV_20 = 0x13   //!<  MCAN clock =  MCAN clock / 20

}SysCtl_MCANClkDivider;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setAuxPLLClk() as \e divider parameter.
//
//*****************************************************************************
typedef enum
{
  SYSCTL_AUXPLLCLK_DIV_1,  //!<  AUXPLL clock =  AUXPLL clock / 1
  SYSCTL_AUXPLLCLK_DIV_2,  //!<  AUXPLL clock =  AUXPLL clock / 2
  SYSCTL_AUXPLLCLK_DIV_4,  //!<  AUXPLL clock =  AUXPLL clock / 4
  SYSCTL_AUXPLLCLK_DIV_8,  //!<  AUXPLL clock =  AUXPLL clock / 8
  SYSCTL_AUXPLLCLK_DIV_3,  //!<  AUXPLL clock =  AUXPLL clock / 3
  SYSCTL_AUXPLLCLK_DIV_5,  //!<  AUXPLL clock =  AUXPLL clock / 5
  SYSCTL_AUXPLLCLK_DIV_6,  //!<  AUXPLL clock =  AUXPLL clock / 6
  SYSCTL_AUXPLLCLK_DIV_7   //!<  AUXPLL clock =  AUXPLL clock / 7

}SysCtl_AuxPLLClkDivider;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setCputimer2Clk() as \e divider parameter.
//
//*****************************************************************************
typedef enum
{
  SYSCTL_TMR2CLKPRESCALE_1,   //!<  Cputimer2 clock =  Cputimer2 clock / 1
  SYSCTL_TMR2CLKPRESCALE_2,   //!<  Cputimer2 clock =  Cputimer2 clock / 2
  SYSCTL_TMR2CLKPRESCALE_4,   //!<  Cputimer2 clock =  Cputimer2 clock / 4
  SYSCTL_TMR2CLKPRESCALE_8,   //!<  Cputimer2 clock =  Cputimer2 clock / 8
  SYSCTL_TMR2CLKPRESCALE_16   //!<  Cputimer2 clock =  Cputimer2 clock / 16

}SysCtl_Cputimer2ClkDivider;

//*****************************************************************************
//
//! The following are values that can be passed to SysCtl_setCputimer2Clk()
//! as \e source parameter.
//
//*****************************************************************************
typedef enum
{
  SYSCTL_TMR2CLKSRCSEL_SYSCLK     = 0U,   //!< System Clock
  SYSCTL_TMR2CLKSRCSEL_INTOSC1    = 1U,   //!< Internal Oscillator 1
  SYSCTL_TMR2CLKSRCSEL_INTOSC2    = 2U,   //!< Internal Oscillator 2
  SYSCTL_TMR2CLKSRCSEL_XTAL       = 3U,   //!< Crystal oscillator
  SYSCTL_TMR2CLKSRCSEL_AUXPLLCLK  = 6U    //!< Aux PLL CLock

}SysCtl_Cputimer2ClkSource;

//*****************************************************************************
//
//! The following are values that can be passed to SysCtl_lockClkConfig()
//! as the \e peripheral parameter.
//
//*****************************************************************************
typedef enum
{
    // CLKCFGLOCK1
    SYSCTL_REG_SEL_CLKSRCCTL1       = 0x0000,  //!< CLKSRCCTL1 lock
    SYSCTL_REG_SEL_CLKSRCCTL2       = 0x0100,  //!< CLKSRCCTL2 lock
    SYSCTL_REG_SEL_CLKSRCCTL3       = 0x0200,  //!< CLKSRCCTL3 lock
    SYSCTL_REG_SEL_SYSPLLCTL1       = 0x0300,  //!< SYSPLLCTL1 lock
    SYSCTL_REG_SEL_SYSPLLMULT       = 0x0600,  //!< SYSPLLMULTlock
    SYSCTL_REG_SEL_AUXPLLCTL1       = 0x0700,  //!< AUXPLLCTL1 lock
    SYSCTL_REG_SEL_AUXPLLMULT       = 0x0A00,  //!< AUXPLLMULT lock
    SYSCTL_REG_SEL_SYSCLKDIVSEL     = 0x0B00,  //!< SYSCLKDIVSEL lock
    SYSCTL_REG_SEL_AUXCLKDIVSEL     = 0x0C00,  //!< AUXCLKDIVSEL lock
    SYSCTL_REG_SEL_PERCLKDIVSEL     = 0x0D00,  //!< PERCLKDIVSEL lock
    SYSCTL_REG_SEL_LOSPCP           = 0x0F00,  //!< LOSPCP lock
    SYSCTL_REG_SEL_XTALCR           = 0x1000,  //!< XTALCR lock
    SYSCTL_REG_SEL_ETHERCATCLKCTL   = 0x1100,  //!< ETHERCATCLKCTL lock
    SYSCTL_REG_SEL_CMCLKCTL         = 0x1200   //!< CMCLKCTL lock

} SysCtl_ClkRegSel;

//*****************************************************************************
//
//! The following are values that can be passed to SysCtl_lockSysConfig()
//! as the \e peripheral parameter.
//
//*****************************************************************************
typedef enum
{
    // CPUSYSLOCK1
    SYSCTL_REG_SEL_PIEVERRADDR      = 0x0200,  //!< PIEVERRADDR lock
    SYSCTL_REG_SEL_PCLKCR0          = 0x0300,  //!< PCLKCR0 lock
    SYSCTL_REG_SEL_PCLKCR1          = 0x0400,  //!< PCLKCR1 lock
    SYSCTL_REG_SEL_PCLKCR2          = 0x0500,  //!< PCLKCR2 lock
    SYSCTL_REG_SEL_PCLKCR3          = 0x0600,  //!< PCLKCR3 lock
    SYSCTL_REG_SEL_PCLKCR4          = 0x0700,  //!< PCLKCR4 lock
    SYSCTL_REG_SEL_PCLKCR6          = 0x0900,  //!< PCLKCR6 lock
    SYSCTL_REG_SEL_PCLKCR7          = 0x0A00,  //!< PCLKCR7 lock
    SYSCTL_REG_SEL_PCLKCR8          = 0x0B00,  //!< PCLKCR8 lock
    SYSCTL_REG_SEL_PCLKCR9          = 0x0C00,  //!< PCLKCR9 lock
    SYSCTL_REG_SEL_PCLKCR10         = 0x0D00,  //!< PCLKCR10 lock
    SYSCTL_REG_SEL_PCLKCR11         = 0x0E00,  //!< PCLKCR11 lock
    SYSCTL_REG_SEL_PCLKCR13         = 0x1000,  //!< PCLKCR13 lock
    SYSCTL_REG_SEL_PCLKCR14         = 0x1100,  //!< PCLKCR14 lock
    SYSCTL_REG_SEL_PCLKCR16         = 0x1300,  //!< PCLKCR16 lock
    SYSCTL_REG_SEL_SECMSEL          = 0x1400,  //!< SECMSEL lock
    SYSCTL_REG_SEL_LPMCR            = 0x1500,  //!< LPMCR lock
    SYSCTL_REG_SEL_GPIOLPMSEL0      = 0x1600,  //!< GPIOLPMSEL0 lock
    SYSCTL_REG_SEL_GPIOLPMSEL1      = 0x1700,  //!< GPIOLPMSEL1 lock
    SYSCTL_REG_SEL_PCLKCR17         = 0x1800,  //!< PCLKCR17 lock
    SYSCTL_REG_SEL_PCLKCR18         = 0x1900,  //!< PCLKCR18 lock
    SYSCTL_REG_SEL_PCLKCR20         = 0x1B00,  //!< PCLKCR20 lock
    SYSCTL_REG_SEL_PCLKCR21         = 0x1C00,  //!< PCLKCR21 lock
    SYSCTL_REG_SEL_PCLKCR22         = 0x1D00,  //!< PCLKCR22 lock
    SYSCTL_REG_SEL_PCLKCR23         = 0x1E00,  //!< PCLKCR23 lock

