yahalit/Ilia/Sw3/BolshoyManipCpu2R3/F2838x_driverlib/driverlib/sysctl.h
}
//*****************************************************************************
//
//! Enables ePWM SOC signals to drive an external (off-chip) ADCSOC signal.
//!
//! \param adcsocSrc is a bit field of the selected signals to be enabled
//!
//! This function configures which ePWM SOC signals are enabled as a source for
//! either ADCSOCAO or ADCSOCBO. The \e adcsocSrc parameter takes a logical OR
//! of \b SYSCTL_ADCSOC_SRC_PWMxSOCA/B values that correspond to different
//! signals.
//!
//! \return None.
//
//*****************************************************************************
static inline void
SysCtl_enableExtADCSOCSource(uint32_t adcsocSrc)
{
    //
    // Set the bits that correspond to signal to be enabled.
    //
    EALLOW;
    HWREG(SYNCSOC_BASE + SYSCTL_O_ADCSOCOUTSELECT) |= adcsocSrc;
    EDIS;
}

//*****************************************************************************
//
//! Disables ePWM SOC signals from driving an external ADCSOC signal.
//!
//! \param adcsocSrc is a bit field of the selected signals to be disabled
//!
//! This function configures which ePWM SOC signals are disabled as a source
//! for either ADCSOCAO or ADCSOCBO. The \e adcsocSrc parameter takes a logical
//! OR of \b SYSCTL_ADCSOC_SRC_PWMxSOCA/B values that correspond to different
//! signals.
//!
//! \return None.
//
//*****************************************************************************
static inline void
SysCtl_disableExtADCSOCSource(uint32_t adcsocSrc)
{
    //
    // Clear the bits that correspond to signal to be disabled.
    //
    EALLOW;
    HWREG(SYNCSOC_BASE + SYSCTL_O_ADCSOCOUTSELECT) &= ~adcsocSrc;
    EDIS;
}

//*****************************************************************************
//
//! Locks the SOC Select of the Trig X-BAR.
//!
//! This function locks the external ADC SOC select of the Trig X-BAR.
//!
//! \return None.
//
//*****************************************************************************
static inline void
SysCtl_lockExtADCSOCSelect(void)
{
    //
    // Lock the ADCSOCOUTSELECT bit of the SYNCSOCLOCK register.
    //
    EALLOW;
    HWREG(SYNCSOC_BASE + SYSCTL_O_SYNCSOCLOCK) =
        SYSCTL_SYNCSOCLOCK_ADCSOCOUTSELECT;
    EDIS;
}
//*****************************************************************************
//
//! Locks the Sync Select of the Trig X-BAR.
//!
//! This function locks Sync Input and Output Select of the Trig X-BAR.
//!
//! \return None.
//
//*****************************************************************************
static inline void
SysCtl_lockSyncSelect(void)
{
    //
    // Lock the SYNCSELECT register.
    //
    EALLOW;
    HWREG(SYNCSOC_BASE + SYSCTL_O_SYNCSOCLOCK) = SYSCTL_SYNCSOCLOCK_SYNCSELECT;
    EDIS;
}
//*****************************************************************************
//
//! Configures whether a peripheral is connected to CPU1 or CPU2.
//!
//! \param peripheral is the peripheral for which CPU needs to be configured.
//! \param peripheralInst is the instance for which CPU needs to be configured.
//! \param cpuInst is the CPU to which the peripheral instance need to be
//!                connected.
//!
//! The \e peripheral parameter can have one enumerated value from
//! SysCtl_CPUSelPeripheral
//!
//! The \e peripheralInst parameter is the instance number for example
//! 1 for EPWM1, 2 for EPWM2 so on.For instances which are named with alphabets
//! (instead of numbers) the following convention needs to be followed.
//! 1 for A (SPI_A), 2 for B (SPI_B), 3 for C (SPI_C) so on...
//! For peripherals with different RX and TX instances which are named
//! with alphabets, the following convention needs to be followed.
//! 1 for TX_A (FSITX_A), 2 for TX_B (FSITX_B) and so on...
//! 17 for RX_A (FSIRX_A), 18 for RX_B (FSIRX_B) and so on...
//!
//! The \e cpuInst parameter can have one the following values:
//! - \b SYSCTL_CPUSEL_CPU1 - to connect to CPU1
//! - \b SYSCTL_CPUSEL_CPU2 - to connect to CPU2
//!
//! \note This API is applicable only for the CPU1 subsystem.
//!
//! \return None.
//
//*****************************************************************************
static inline void
SysCtl_selectCPUForPeripheral(SysCtl_CPUSelPeripheral peripheral,
                              uint16_t peripheralInst, SysCtl_CPUSel cpuInst)
{
    uint32_t tempValue;
    uint16_t shift;

    if(SYSCTL_CPUSEL14_DAC == peripheral)
    {
        shift = peripheralInst + SYSCTL_CPUSEL_DAC_S - 1U;
    }
    else
    {
        shift = peripheralInst - 1U;
    }

    tempValue =
        HWREG(DEVCFG_BASE + SYSCTL_O_CPUSEL0 + ((uint32_t)peripheral * 2U)) &
        (~((uint32_t)1U << shift));

    EALLOW;
    HWREG(DEVCFG_BASE + SYSCTL_O_CPUSEL0 + ((uint32_t)peripheral * 2U)) =
        tempValue | ((uint32_t)cpuInst << shift);
    EDIS;
}
//*****************************************************************************
//
//! Get the Device Silicon Revision ID
//!
//! This function returns the silicon revision ID for the device.
//!
//! \note This API is applicable only for the CPU1 subsystem.
//!
//! \return Returns the silicon revision ID value.
//
//*****************************************************************************
static inline uint32_t
SysCtl_getDeviceRevision(void)
{
    //
    // Returns the device silicon revision ID
    //
    return(HWREG(DEVCFG_BASE + SYSCTL_O_REVID));
}

//*****************************************************************************
//
//! Locks the CPU select registers for the peripherals
//!
//! \param peripheral is the peripheral for which CPU needs to be selected.
//!
//! The \e peripheral parameter can have one enumerated value from
//! SysCtl_CPUSelPeripheral
//!
//! \note This API is applicable only for the CPU1 subsystem.
//!
//! \return None.
//
//*****************************************************************************

static inline void
SysCtl_lockCPUSelectRegs(SysCtl_CPUSelPeripheral peripheral)
{
  EALLOW;
  HWREG(DEVCFG_BASE + SYSCTL_O_DEVCFGLOCK1) |= ((uint32_t)1U << peripheral);
  EDIS;
}

//*****************************************************************************
//
//! Reads the ADC wrapper mode for the provided ADC
//!
//! \param peripheral is the ADC for which the configuration is to be read.
//!
//! The \e peripheral parameter can have one enumerated value from
//! SysCtl_SelADC
//!
//! \note This API is applicable only for the CPU1 subsystem.
//!
//! \return Returns the supported resolution of the particular ADC.
//!  This can be either of the 2 resolutions below:
//!  1. Operate in 16-bit or 12-bit configurable (0x0U)
//!  2. Operate only in 12-bit configurable (0x1U)
//
//*****************************************************************************

static inline uint32_t
SysCtl_readADCWrapper(SysCtl_SelADC peripheral)
{

    //
    // Reads the ADC wrapper mode
    //
    return((HWREG(DEVCFG_BASE + SYSCTL_O_PERCNF1) &
          (SYSCTL_PERCNF1_ADC_A_MODE << (uint32_t)peripheral))>>
          (uint32_t)peripheral);
}

//*****************************************************************************
//
//! Gets the error status of the Efuse
//!
//! The function provides both the Efuse Autoload & the Efuse Self Test
//! Error Status.
//!
//! \note This API is applicable only for the CPU1 subsystem.
//!
//! \return Fuse Error status.
//
//*****************************************************************************

static inline uint16_t
SysCtl_getEfuseError(void)
{
  return(HWREGH(DEVCFG_BASE + SYSCTL_O_FUSEERR));
}

//*****************************************************************************
//
//! Check if the CPU2 is held in reset or not
//!
//! Provides the reset status of CPU2 to CPU1
//!
//! \note This API is applicable only for the CPU1 subsystem.
//!
//! \return \b true if CPU2 core is in reset \b false if CPU2 core
//! is out of reset
//
//*****************************************************************************

static inline bool
SysCtl_isCPU2Reset(void)
{
  return((HWREGH(DEVCFG_BASE + SYSCTL_O_RSTSTAT) &
          SYSCTL_RSTSTAT_CPU2RES) == 0U);
}

//*****************************************************************************
//
//! Gets the status/causes of the CPU2 reset.
//!
//! The function provides causes of the CPU2 being in reset / not.
//! This could be either of the following values or a combination of both:
//!
//! - SYSCTL_RSTSTAT_CPU2RES
//! - SYSCTL_RSTSTAT_CPU2NMIWDRST
//! - SYSCTL_RSTSTAT_CPU2HWBISTRST
//!
//! \note This API is applicable only for the CPU1 subsystem.
//!
//! \return Reset cause of CPU2.
//
//*****************************************************************************

static inline uint16_t
SysCtl_getCPU2ResetStatus(void)
{
  return(HWREGH(DEVCFG_BASE + SYSCTL_O_RSTSTAT));
}

//*****************************************************************************
//
//! Clears the CPU2 reset status.
//!
//! \param rstCauses are the reset causes to be cleared
//!
//! This function clears the CPU2 reset status. This could be either of the
//! following values or a combination of both:
//!
//! - SYSCTL_RSTSTAT_CPU2NMIWDRST
//! - SYSCTL_RSTSTAT_CPU2HWBISTRST.
//!
//! To check if it was set first, see SysCtl_getCPU2ResetStatus().
//!
//! \note This API is applicable only for the CPU1 subsystem.
//!
//! \return None.
//
//*****************************************************************************

static inline void
SysCtl_clearCPU2ResetStatus(uint16_t rstCauses )
{
  HWREGH(DEVCFG_BASE + SYSCTL_O_RSTSTAT) |= rstCauses;
}
//*****************************************************************************
//
//! Gets the state of the CPU2.
//!
//! The function indicates the power mode of the CPU2. It could be either in
//! ACTIVE , IDLE or STANDBY mode.
//!
//! \note This API is applicable only for the CPU1 subsystem.
//!
//! \return Power mode of CPU2.
//
//*****************************************************************************

static inline uint16_t
SysCtl_getCPU2LPMStatus(void)
{
  return(HWREGH(DEVCFG_BASE + SYSCTL_O_LPMSTAT));
}

//*****************************************************************************
//
//! Selects the BANK to be programmed by CPU1.
//!
//! \param bank is the BANK to be programmed.
//!
//! The \e bank parameter can have one enumerated value from
//! SysCtl_CPUBank
//!
//! \note This API is applicable only for the CPU1 subsystem.
//!
//! \return None.
//
//*****************************************************************************

static inline void
SysCtl_selectBank(SysCtl_CPUBank bank)
{
  EALLOW;
  HWREGH(DEVCFG_BASE + SYSCTL_O_BANKSEL) = (uint16_t)bank;
  EDIS;
}
//*****************************************************************************
//
//! Gets the Ownership details for clock configuration
//!
//! A CPU can perform read/writes to any of the CLKCFG registers only
//! if  it owns the semaphore. Otherwise, writes are ignored and reads
//! will return 0x0.
//!
//! \note Reads and writes of this ownership register are always
//! allowed from both CPU1 and CPU2.
//!
//! \return Clock control Ownership details
//
//*****************************************************************************

static inline uint16_t
SysCtl_getSemOwner(void)
{

  return(HWREGH(CLKCFG_BASE + SYSCTL_O_CLKSEM));
}

//*****************************************************************************
//
//! Sets up XCLK divider.
//!
//! \param divider is the value that configures the divider.
//!
//! This function sets up the XCLK divider. There is only one
//! divider that scales INTOSC1 to XCLK.
//!
//! The \e divider parameter can have one enumerated value from
//! SysCtl_XClkDivider
//!
//! \return None.
//
//*****************************************************************************

static inline void
SysCtl_setXClk(SysCtl_XClkDivider divider)
{
  //
  // Clears the divider then configures it.
  //
  EALLOW;
  HWREGH(CLKCFG_BASE +
         SYSCTL_O_XCLKOUTDIVSEL) = (HWREGH(CLKCFG_BASE +
                                           SYSCTL_O_XCLKOUTDIVSEL) &
                                    ~(SYSCTL_XCLKOUTDIVSEL_XCLKOUTDIV_M)) |
                                    (uint16_t)divider;
  EDIS;
}

//*****************************************************************************
//
//! Sets up CM CLK source & divider.
//!
//! \param divider is the value that configures the divider.
//! \param source is the source for the clock divider
//!
//! This function sets up the CM CLK divider based on the source that
//! is selected. There is only one divider that scales the "source" to CM CLK.
//!
//! The \e divider parameter can have one enumerated value from
//! SysCtl_CMClkDivider
//! The \e source parameter can have one enumerated value from
//! SysCtl_PLLClockSource
//!
//! \return None.
//
//*****************************************************************************

static inline void
SysCtl_setCMClk(SysCtl_CMClkDivider divider, SysCtl_PLLClockSource source)
{
  //
  // Clears the divider & the source, then configures it.
  //
  EALLOW;
  HWREGH(CLKCFG_BASE + SYSCTL_O_CMCLKCTL) = (HWREGH(CLKCFG_BASE +
                                             SYSCTL_O_CMCLKCTL) &
                                           ~(SYSCTL_CMCLKCTL_CMCLKDIV_M |
                                             SYSCTL_CMCLKCTL_CMDIVSRCSEL));

  HWREGH(CLKCFG_BASE + SYSCTL_O_CMCLKCTL) |= ((uint16_t)divider <<
                                             SYSCTL_CMCLKCTL_CMCLKDIV_S) |
                                            ((uint16_t)source <<
                                             SYSCTL_CMCLKCTL_CMDIVSRCSEL_S);
  EDIS;
}

//*****************************************************************************
//
//! Sets up Ethernet CLK source & divider.
//!
//! \param divider is the value that configures the divider.
//! \param source is the source for the clock divider
//!
//! This function sets up the Ethernet CLK divider based on the source that
//! is selected. There is only one divider that scales the "source" to
//! Ethernet CLK.
//!
//! The \e divider parameter can have one enumerated value from
//! SysCtl_EnetClkDivider
//! The \e source parameter can have one enumerated value from
//! SysCtl_PLLClockSource
//!
//! \return None.
//
//*****************************************************************************

static inline void
SysCtl_setEnetClk(SysCtl_EnetClkDivider divider, SysCtl_PLLClockSource source)
{
  //
  // Clears the divider & the source, then configures it.
  //
  EALLOW;
  HWREGH(CLKCFG_BASE + SYSCTL_O_CMCLKCTL) = (HWREGH(CLKCFG_BASE +
                                             SYSCTL_O_CMCLKCTL) &
                                           ~(SYSCTL_CMCLKCTL_ETHDIV_M |
                                             SYSCTL_CMCLKCTL_ETHDIVSRCSEL));

  HWREGH(CLKCFG_BASE + SYSCTL_O_CMCLKCTL) |= ((uint16_t)divider <<
                                             SYSCTL_CMCLKCTL_ETHDIV_S) |
                                            ((uint16_t)source <<
                                             SYSCTL_CMCLKCTL_ETHDIVSRCSEL_S);
  EDIS;
}

//*****************************************************************************
//
//! Sets up Ethercat CLK source, divider & PHY clock.
//!
//! \param divider is the value that configures the divider.
//! \param source is the source for the clock divider
//! \param enable enables/disables the etherCAT PHY clock
//!
//! This function sets up the Ethercat CLK divider based on the source that
//! is selected. There is only one divider that scales the "source" to
//! Ethercat CLK.
//! This also enables/disables the etherCAT PHY clock.
//!
//! The \e divider parameter can have one enumerated value from
//! SysCtl_ECatClkDivider
//! The \e source parameter can have one enumerated value from
//! SysCtl_PLLClockSource
//! The \e enable parameter can be either of these values:
//! 0x0U: etherCAT PHY clock is disabled
//! 0x1U: etherCAT PHY clock is enabled
//!
//! \return None.
//
//*****************************************************************************

static inline void
SysCtl_setECatClk(SysCtl_ECatClkDivider divider, SysCtl_PLLClockSource source,
                        uint16_t enable)
{
  //
  // Clears the divider & the source, then configures it.
  //
  EALLOW;
  HWREGH(CLKCFG_BASE +
         SYSCTL_O_ETHERCATCLKCTL) = (HWREGH(CLKCFG_BASE +
                                             SYSCTL_O_ETHERCATCLKCTL) &
                                     ~(SYSCTL_ETHERCATCLKCTL_PHYCLKEN |
                                       SYSCTL_ETHERCATCLKCTL_ECATDIV_M |
                                       SYSCTL_ETHERCATCLKCTL_DIVSRCSEL));

