yahalit/Ilia/Sw3/BolshoyManipCpu2R3/F2838x_driverlib/driverlib/sysctl.h
  HWREGH(CLKCFG_BASE +
         SYSCTL_O_ETHERCATCLKCTL) |= ((uint16_t)divider <<
                                     SYSCTL_ETHERCATCLKCTL_ECATDIV_S) |
                                    ((uint16_t)source <<
                                     SYSCTL_ETHERCATCLKCTL_DIVSRCSEL_S) |
                                    (enable <<
                                     SYSCTL_ETHERCATCLKCTL_PHYCLKEN_S);
  EDIS;
}

//*****************************************************************************
//
//! Sets up PLLSYSCLK divider.
//!
//! \param divider is the value that configures the divider.
//!
//! This function sets up the PLLSYSCLK divider. There is only one
//! divider that scales PLLSYSCLK to generate the system clock.
//!
//! The \e divider parameter can have one value from the set below:
//!     0x0 = /1
//!     0x1 = /2
//!     0x2 = /4 (default on reset)
//!     0x3 = /6
//!     0x4 = /8
//!    ......
//!     0x3F =/126
//!
//! \return None.
//!
//! \note Please make sure to check if the PLL is locked and valid using the
//! SysCtl_isPLLValid() before setting the divider.
//
//*****************************************************************************

static inline void
SysCtl_setPLLSysClk(uint16_t divider)
{
  //
  // Clears the divider then configures it.
  //
  EALLOW;
  HWREGH(CLKCFG_BASE +
         SYSCTL_O_SYSCLKDIVSEL) = (HWREGH(CLKCFG_BASE +
                                           SYSCTL_O_SYSCLKDIVSEL) &
                                  ~(SYSCTL_SYSCLKDIVSEL_PLLSYSCLKDIV_M)) |
                                   divider;
  EDIS;
}

//*****************************************************************************
//
//! Sets up AUXPLLCLK divider.
//!
//! \param divider is the value that configures the divider.
//!
//! This function sets up the AUXPLLCLK divider. There is only one
//! divider that scales AUXPLLCLK to generate the system clock.
//!
//! The \e divider parameter can have one enumerated value from
//! SysCtl_AuxPLLClkDivider
//!
//! \return None.
//!
//! \note Please make sure to check if the PLL is locked and valid using the
//! SysCtl_isPLLValid() before setting the divider.
//
//*****************************************************************************

static inline void
SysCtl_setAuxPLLClk(SysCtl_AuxPLLClkDivider divider)
{
  //
  // Clears the divider then configures it.
  //
  EALLOW;
  HWREGH(CLKCFG_BASE +
         SYSCTL_O_AUXCLKDIVSEL) = (HWREGH(CLKCFG_BASE +
                                          SYSCTL_O_AUXCLKDIVSEL) &
                                   ~(SYSCTL_AUXCLKDIVSEL_AUXPLLDIV_M)) |
                                  (uint16_t)divider;
  EDIS;
}

//*****************************************************************************
//
//! Sets up MCAN Clk divider.
//!
//! \param divider is the value that configures the divider.
//!
//! This function sets up the MCANCLK divider. There is only one
//! divider that scales MCAN clock.
//!
//! The \e divider parameter can have one enumerated value from
//! SysCtl_MCANClkDivider
//!
//! \return None.
//
//*****************************************************************************

static inline void
SysCtl_setMCANClk(SysCtl_MCANClkDivider divider)
{
  //
  // Clears the divider then configures it.
  //
  EALLOW;
  HWREGH(CLKCFG_BASE +
         SYSCTL_O_AUXCLKDIVSEL) = (HWREGH(CLKCFG_BASE +
                                           SYSCTL_O_AUXCLKDIVSEL) &
                                  ~(SYSCTL_AUXCLKDIVSEL_MCANCLKDIV_M)) |
                                   ((uint16_t)divider <<
                                    SYSCTL_AUXCLKDIVSEL_MCANCLKDIV_S);
  EDIS;
}

//*****************************************************************************
//
//! Sets up CPU Timer 2  CLK source & divider.
//!
//! \param divider is the value that configures the divider.
//! \param source is the source for the clock divider
//!
//! This function sets up the CPU Timer 2 CLK divider based on the source that
//! is selected. There is only one divider that scales the "source" to
//! CPU Timer 2 CLK.
//!
//! The \e divider parameter can have one enumerated value from
//! SysCtl_Cputimer2ClkDivider
//! The \e source parameter can have one enumerated value from
//! SysCtl_Cputimer2ClkSource
//!
//! \return None.
//
//*****************************************************************************

static inline void
SysCtl_setCputimer2Clk(SysCtl_Cputimer2ClkDivider divider,
                               SysCtl_Cputimer2ClkSource source)
{
  //
  // Clears the divider & the source, then configures it.
  //
  EALLOW;
  HWREGH(CPUSYS_BASE +
         SYSCTL_O_TMR2CLKCTL) = (HWREGH(CPUSYS_BASE +
                                        SYSCTL_O_TMR2CLKCTL) &
                                 ~(SYSCTL_TMR2CLKCTL_TMR2CLKSRCSEL_M |
                                   SYSCTL_TMR2CLKCTL_TMR2CLKPRESCALE_M));

  HWREGH(CPUSYS_BASE +
         SYSCTL_O_TMR2CLKCTL) |= ((uint16_t)divider <<
                                  SYSCTL_TMR2CLKCTL_TMR2CLKPRESCALE_S) |
                                 ((uint16_t)source <<
                                  SYSCTL_TMR2CLKCTL_TMR2CLKSRCSEL_S);
  EDIS;
}

//*****************************************************************************
//
//! Enables the Ethercat I2C loopback.
//!
//! This function enables the Ethercat I2C loopback. Note that the Ethercat I2C
//!  loopback is disabled on reset.
//!
//! \return None.
//
//*****************************************************************************

static inline void
SysCtl_enableEthercatI2Cloopback(void)
{
  //
  // Set the I2C loopback enable bit.
  //
  EALLOW;
  HWREGH(CPUSYS_BASE + SYSCTL_O_ETHERCATCTL)|= SYSCTL_ETHERCAT_I2C_LOOPBACK ;
  EDIS;
}

//*****************************************************************************
//
//! Disables the Ethercat I2C loopback.
//!
//! This function disables the Ethercat I2C loopback.Note that the Ethercat I2C
//!  loopback is enabled on reset.
//!
//! \return None.
//
//*****************************************************************************

static inline void
SysCtl_disableEthercatI2Cloopback(void)
{
  //
  // Clear the I2C loopback enable bit.
  //
  EALLOW;
  HWREGH(CPUSYS_BASE + SYSCTL_O_ETHERCATCTL) &= ~SYSCTL_ETHERCAT_I2C_LOOPBACK ;
  EDIS;

