yahalit/Ilia/Sw3/BolshoyManipCpu2R3/F2838x_driverlib/driverlib/sysctl.h
}

//*****************************************************************************
//
//! Gets the PIE Vector Fetch Error Handler Routine Address.
//!
//! The function indicates the address of the PIE Vector Fetch Error
//! handler routine.
//!
//! \return Error Handler Address.
//!
//! \note Its the responsibility of user to initialize this register. If this
//! register is not initialized, a default error handler at address
//! 0x3fffbe will get executed.
//
//*****************************************************************************

static inline uint32_t
SysCtl_getPIEVErrAddr(void)
{
  return(HWREG(CPUSYS_BASE + SYSCTL_O_PIEVERRADDR));
}

//*****************************************************************************
//
//! Simulates a reset to the CPU1
//!
//! \param rstCauses is the cause for the reset.
//!
//! The \e rstCauses parameter can be one/ more of these values:
//! SYSCTL_CAUSE_CPU1RSN or SYSCTL_CAUSE_XRS
//!
//! \return None.
//!
//! \note This API exists only on CPU1
//
//*****************************************************************************

static inline void
SysCtl_simulateReset(uint32_t rstCauses)
{
  //Write will succeed only if a matching key value is written
  //to the KEY field
  //Sets the appropriate reset bit.
  //
  HWREG(CPUSYS_BASE + SYSCTL_O_SIMRESET)  = (rstCauses |
                                            (SYSCTL_REG_KEY &
                                             SYSCTL_SIMRESET_KEY_M));
}
//*****************************************************************************
//
//! Check if the CM is held in reset or not
//!
//! Provides the reset status of CM to the CPU
//!
//! \note This API is applicable only for the CPU1 subsystem.
//!
//! \return \b true if CM is in reset \b false if CM is out of reset
//
//*****************************************************************************

static inline bool
SysCtl_isCMReset(void)
{
  return((HWREGH(CMCONF_BASE + SYSCTL_O_CMRESCTL) &
          SYSCTL_CMRESCTL_RESETSTS)== 0U);
}

//*****************************************************************************
//
//! Enables the NMI generation to the C28x core
//!
//! \param Flags is the Bit mask of the NMI interrupts that user
//! wants, to generate an NMI to the C28x.
//!
//! The \e Flags parameter can be the value :
//! SYSCTL_FLAG_CMNMIWDRST.
//!
//! \note This API is applicable only for the CPU1 subsystem.
//!
//! \return None.
//
//*****************************************************************************

static inline void
SysCtl_enableCMtoCPUNMI (uint32_t Flags)
{
  EALLOW;
  HWREGH(CMCONF_BASE + SYSCTL_O_CMTOCPU1NMICTL)|= Flags ;
  EDIS;
}

//*****************************************************************************
//
//! Enables the Interrupt generation to the C28x core
//!
//! \param Flags is the Bit mask of the Interrupts that user
//! wants, to generate an Interrupt to the C28x.
//!
//! The \e Flags parameter can be the value :
//! SYSCTL_FLAG_CMNMIWDRST.
//!
//! \note This API is applicable only for the CPU1 subsystem.
//!
//! \return None.
//
//*****************************************************************************

static inline void
SysCtl_enableCMtoCPUInterrupt (uint32_t Flags)
{
  EALLOW;
  HWREGH(CMCONF_BASE + SYSCTL_O_CMTOCPU1INTCTL)|= Flags ;
  EDIS;
}

//*****************************************************************************
//
//! Disables the NMI generation to the C28x core
//!
//! \param Flags is the Bit mask of the NMI interrupts that user
//! wants, to generate an NMI to the C28x.
//!
//! The \e Flags parameter can be the value :
//! SYSCTL_FLAG_CMNMIWDRST.
//!
//! \note This API is applicable only for the CPU1 subsystem.
//!
//! \return None.
//
//*****************************************************************************

static inline void
SysCtl_disableCMtoCPUNMI (uint32_t Flags)
{
  EALLOW;
  HWREGH(CMCONF_BASE + SYSCTL_O_CMTOCPU1NMICTL)&= ~Flags ;
  EDIS;
}

//*****************************************************************************
//
//! Disables the Interrupt generation to the C28x core
//!
//! \param Flags is the Bit mask of the Interrupts that user
//! wants, to generate an Interrupt to the C28x.
//!
//! The \e Flags parameter can be the value :
//! SYSCTL_FLAG_CMNMIWDRST.
//!
//! \note This API is applicable only for the CPU1 subsystem.
//!
//! \return None.
//
//*****************************************************************************

static inline void
SysCtl_disableCMtoCPUInterrupt (uint32_t Flags)
{
  EALLOW;
  HWREGH(CMCONF_BASE + SYSCTL_O_CMTOCPU1INTCTL)&= ~Flags ;
  EDIS;
}

//*****************************************************************************
//
//! Gets the NMI generated on the C28x core
//!
//! \note This API is applicable only for the CPU1 subsystem.
//!
//! \return the NMI generated to the C28x.  The value can be:
//! SYSCTL_FLAG_CMNMIWDRST.
//
//*****************************************************************************

static inline uint16_t
SysCtl_getCMtoCPUNMI (void)
{
  return(HWREGH(CMCONF_BASE + SYSCTL_O_CMTOCPU1NMICTL));
}

//*****************************************************************************
//
//! Gets the Interrupt generated on the C28x core
//!
//! \note This API is applicable only for the CPU1 subsystem.
//!
//! \return the Interrupt generated to the C28x.  The value can be:
//! SYSCTL_FLAG_CMNMIWDRST.
//
//*****************************************************************************

static inline uint16_t
SysCtl_getCMtoCPUInterrupt (void)
{
  return(HWREGH(CMCONF_BASE + SYSCTL_O_CMTOCPU1INTCTL));
}

//*****************************************************************************
//
//! Configures the CM Peripheral Allocation for shared peripherals.
//!
//! \param peripheral is the peripheral being allocated to CM.
//! \param allocate decides if the peripheral is allocated to the C28x CPU1/2
//! or the CM.
//!
//! The \e peripheral parameter can have one enumerated value from
//! SysCtl_SharedPeripheral
//!
//! The \e allocate parameter can have one of the values from:
//! 0x0U: Peripheral is allocated to C28x CPU1/2, CM accesses to it will
//! be ignored and interrupts from it will not be generated to CM.
//! 0x1U: Peripheral is allocated to CM, C28x CPU1/2 accesses to it will
//! be ignored and interrupts from it will not be generated to C28x CPU1/2.
//!
//! \return None.
//!
//! \note This API must be configured prior to enabling the
//! peripheral clocks. CPU2 does not have access to this API for MCAN
//! EtherCAT & USB peripherals.
//
//*****************************************************************************

static inline void
SysCtl_allocateSharedPeripheral(SysCtl_SharedPeripheral peripheral,
                                         uint16_t  allocate)
{
  EALLOW;
  //
  // Allocates the peripheral based on if the C28x or CM need access
  //
  if(allocate != 0x0U)
   {
    HWREG(CMCONF_BASE + SYSCTL_O_PALLOCATE0) |= ((uint32_t)1U << peripheral);
   }
  else
   {
    HWREG(CMCONF_BASE + SYSCTL_O_PALLOCATE0) &= ~((uint32_t)1U << peripheral);
   }
  EDIS;
}

//*****************************************************************************
//
//! Locks the CM configuration registers
//!
//! This function locks the CM configuration registers below.
//! 1. PALLOCATE0
//! 2. CMTOCPU1NMICTL
//! 3. CMTOCPU1INTCTL
//!
//! \note This API is applicable only for the CPU1 subsystem.
//!
//! \return None.
//
//*****************************************************************************

static inline void
SysCtl_lockCMConfig(void)
{
  EALLOW;
  HWREG(CMCONF_BASE +
        SYSCTL_O_CM_CONF_REGS_LOCK) = SYSCTL_CM_CONF_REGS_LOCK_LOCK;
  EDIS;
}

//*****************************************************************************
//
//! Gets the status of interrupts due to multiple sources of Cortex-M4 reset.
//!
//! \return the Interrupt generated on reset of the CM.  The values can be
//! one/ more from:
//! SYSCTL_STATUS_CMGINT , SYSCTL_STATUS_CMNMIWDRST ,
//! SYSCTL_STATUS_CMSYSRESETREQ or SYSCTL_STATUS_CMVECTRESET.
//!
//! \note This API  is present only on CPU1.
//
//*****************************************************************************
static inline uint32_t
SysCtl_getCMInterruptStatus(void)
{
  return(HWREG(SYSSTAT_BASE + SYSCTL_O_CM_STATUS_INT_FLG));
}

//*****************************************************************************
//
//! Clears the interrupts due to multiple sources of Cortex-M4 reset.
//!
//! \param intFlags is the interrupt that needs to be cleared.
//!
//! The \e intFlags parameter are the Interrupts generated on reset of the CM
//! that need to be cleared. The values can be one/ more from:
//! SYSCTL_STATUS_CMGINT , SYSCTL_STATUS_CMNMIWDRST ,
//! SYSCTL_STATUS_CMSYSRESETREQ or SYSCTL_STATUS_CMVECTRESET.
//!
//! \return None.
//!
//! \note This API  is present only on CPU1.
//
//*****************************************************************************

static inline void
SysCtl_clearCMInterruptStatus(uint32_t intFlags)
{
  HWREGH(SYSSTAT_BASE + SYSCTL_O_CM_STATUS_INT_CLR) |= intFlags;
}

//*****************************************************************************
//
//! Sets the interrupt for the multiple sources of Cortex-M4 reset.
//!
//! \param intFlags is the interrupt that needs to be set.
//!
//! The \e intFlags parameter are the Interrupts generated on reset of the CM
//! that need to be set. The values can be one/ more from:
//! SYSCTL_STATUS_CMGINT , SYSCTL_STATUS_CMNMIWDRST ,
//! SYSCTL_STATUS_CMSYSRESETREQ or SYSCTL_STATUS_CMVECTRESET.
//!
//! \return None.
//!
//! \note This API  is present only on CPU1.
//
//*****************************************************************************

static inline void
SysCtl_setCMInterruptStatus(uint32_t intFlags)
{
  EALLOW;
  HWREG(SYSSTAT_BASE +
        SYSCTL_O_CM_STATUS_INT_SET)  = (intFlags |
                                       (SYSCTL_REG_KEY &
                                        SYSCTL_CM_STATUS_INT_SET_KEY_M));
  EDIS;
}

//*****************************************************************************
//
//! Gets the masked interrupts due to multiple sources of Cortex-M4 reset.
//!
//! \return the Interrupt generated on reset of the CM.  The values can be
//! one/ more from:
//! SYSCTL_STATUS_CMGINT , SYSCTL_STATUS_CMNMIWDRST ,
//! SYSCTL_STATUS_CMSYSRESETREQ or SYSCTL_STATUS_CMVECTRESET.
//!
//! \note This API  is present only on CPU1.
//
//*****************************************************************************
static inline uint32_t
SysCtl_getCMInterruptStatusMask(void)
{
  return(HWREG(SYSSTAT_BASE + SYSCTL_O_CM_STATUS_MASK));
}

//*****************************************************************************
//
//! Sets the interrupt mask for the multiple sources of Cortex-M4 reset.
//!
//! \param intFlags is the interrupt that needs to be set.
//!
//! The \e intFlags parameter are the Interrupts generated on reset of the CM
//! that need to be masked. The values can be one/ more from:
//! SYSCTL_STATUS_CMGINT , SYSCTL_STATUS_CMNMIWDRST ,
//! SYSCTL_STATUS_CMSYSRESETREQ or SYSCTL_STATUS_CMVECTRESET.
//!
//! \return None.
//!
//! \note This API  is present only on CPU1.
//
//*****************************************************************************

static inline void
SysCtl_setCMInterruptStatusMask(uint32_t intFlags)
{
  EALLOW;
  HWREG(SYSSTAT_BASE +
        SYSCTL_O_CM_STATUS_MASK)  = (intFlags |
                                    (SYSCTL_REG_KEY &
                                     SYSCTL_CM_STATUS_MASK_KEY_M));
  EDIS;
}

//*****************************************************************************
//
//! Gets the status of interrupts due to multiple different
//! errors in the system.
//!
//! \return the Interrupt generated on the system.
//! The values can be one/ more from:
//! - SYSCTL_STATUS_GINT
//! - SYSCTL_STATUS_EMIF_ERR
//! - SYSCTL_STATUS_RAM_CORRECTABLE_ERR
//! - SYSCTL_STATUS_FLASH_CORRECTABLE_ERR
//! - SYSCTL_STATUS_RAM_ACC_VIOL
//! - SYSCTL_STATUS_SYS_PLL_SLIP
//! - SYSCTL_STATUS_AUX_PLL_SLIP
//! - SYSCTL_STATUS_DCC0
//! - SYSCTL_STATUS_DCC1
//! - SYSCTL_STATUS_DCC2
//
//*****************************************************************************

static inline uint32_t
SysCtl_getInterruptStatus(void)
{
  return(HWREG(SYSSTAT_BASE + SYSCTL_O_SYS_ERR_INT_FLG));
}
//*****************************************************************************
//
//! Clears the interrupts due to multiple different errors in the system.
//!
//! \param intFlags is the interrupt that needs to be cleared.
//!
//! The \e intFlags parameter are the Interrupts generated on errors in
//! the system that need to be cleared. The values can be one or more from:
//! - SYSCTL_STATUS_GINT
//! - SYSCTL_STATUS_EMIF_ERR
//! - SYSCTL_STATUS_RAM_CORRECTABLE_ERR
//! - SYSCTL_STATUS_FLASH_CORRECTABLE_ERR
//! - SYSCTL_STATUS_RAM_ACC_VIOL
//! - SYSCTL_STATUS_SYS_PLL_SLIP
//! - SYSCTL_STATUS_AUX_PLL_SLIP
//! - SYSCTL_STATUS_DCC0
//! - SYSCTL_STATUS_DCC1
//! - SYSCTL_STATUS_DCC2
//!
//! \return None.
//
//*****************************************************************************

static inline void
SysCtl_clearInterruptStatus(uint32_t intFlags)
{
  HWREGH(SYSSTAT_BASE + SYSCTL_O_SYS_ERR_INT_CLR) |= intFlags;
}
//*****************************************************************************
//
//! Sets the interrupts for the multiple different errors in the system.
//!
//! \param intFlags is the interrupt that needs to be set.
//!
//! The \e intFlags parameter are the Interrupts that can be set
//! for the errors in the system. The values can be one/ more from:
//! - SYSCTL_STATUS_GINT
//! - SYSCTL_STATUS_EMIF_ERR
//! - SYSCTL_STATUS_RAM_CORRECTABLE_ERR
//! - SYSCTL_STATUS_FLASH_CORRECTABLE_ERR
//! - SYSCTL_STATUS_RAM_ACC_VIOL
//! - SYSCTL_STATUS_SYS_PLL_SLIP
//! - SYSCTL_STATUS_AUX_PLL_SLIP
//! - SYSCTL_STATUS_DCC0
//! - SYSCTL_STATUS_DCC1
//! - SYSCTL_STATUS_DCC2
//!
//! \return None.
//!
//! \note This API  is present only on CPU1.
//
//*****************************************************************************

static inline void
SysCtl_setInterruptStatus(uint32_t intFlags)
{
  EALLOW;
  HWREG(SYSSTAT_BASE +
        SYSCTL_O_SYS_ERR_INT_SET)  = (intFlags |
                                     (SYSCTL_REG_KEY &
                                      SYSCTL_SYS_ERR_INT_SET_KEY_M));
  EDIS;
}

//*****************************************************************************
//
//! Gets the masked interrupts due to multiple different
//! errors in the system.
//!
//! \return the Interrupt generated on the system.
//! The values can be one/ more from:
//! - SYSCTL_STATUS_EMIF_ERR
//! - SYSCTL_STATUS_RAM_CORRECTABLE_ERR
//! - SYSCTL_STATUS_FLASH_CORRECTABLE_ERR
//! - SYSCTL_STATUS_RAM_ACC_VIOL
//! - SYSCTL_STATUS_SYS_PLL_SLIP
//! - SYSCTL_STATUS_AUX_PLL_SLIP
//! - SYSCTL_STATUS_DCC0
//! - SYSCTL_STATUS_DCC1
//! - SYSCTL_STATUS_DCC2
//
//*****************************************************************************

static inline uint32_t
SysCtl_getInterruptStatusMask(void)
{
  return(HWREG(SYSSTAT_BASE + SYSCTL_O_SYS_ERR_MASK));
}

//*****************************************************************************
//
//! Masks the interrupts for the multiple different errors in the system.
//!
//! \param intFlags is the interrupt that needs to be set.
//!
//! The \e intFlags parameter are the Interrupts that can be masked
//! for the errors in the system. The values can be one/ more from:
//! - SYSCTL_STATUS_EMIF_ERR
//! - SYSCTL_STATUS_RAM_CORRECTABLE_ERR
//! - SYSCTL_STATUS_FLASH_CORRECTABLE_ERR
//! - SYSCTL_STATUS_RAM_ACC_VIOL
//! - SYSCTL_STATUS_SYS_PLL_SLIP
//! - SYSCTL_STATUS_AUX_PLL_SLIP
//! - SYSCTL_STATUS_DCC0
//! - SYSCTL_STATUS_DCC1
//! - SYSCTL_STATUS_DCC2
//!
//! \return None.
//!
//! \note This API  is present only on CPU1.
//
//*****************************************************************************

static inline void
SysCtl_setInterruptStatusMask(uint32_t intFlags)
{
  EALLOW;
  HWREG(SYSSTAT_BASE +
        SYSCTL_O_SYS_ERR_MASK)  = (intFlags |
                                  (SYSCTL_REG_KEY &
                                   SYSCTL_SYS_ERR_MASK_KEY_M));
  EDIS;
}

//*****************************************************************************
//
//!  Check if One or more of the error sources triggered
//!
//!  Following are the events/triggers that can indicate an error:
//!1. nmi interrupt on C28x
//!2. Watchdog reset
//!3. Error on a Pie vector fetch
//!4. Efuse error
//!5. nmi interrupt on CM
//!
//! \return \b true if the error is triggered
//! \b false if the error is not triggered
//
//*****************************************************************************
static inline uint16_t
SysCtl_isErrorTriggered(void)
{
  return((HWREGH(NMI_BASE + NMI_O_ERRORSTS) &
          NMI_ERRORSTS_ERROR)!= 0U);
}

//*****************************************************************************
//
//!  Check if Error status pin is high or not
//!
//! \return \b true if the error status pin is high
//! \b false if the error status pin is low
//
//*****************************************************************************
static inline uint16_t
SysCtl_getErrorPinStatus(void)
{
  //
  // Read and return the status of the ErrorPin
  //
  return((HWREGH(NMI_BASE + NMI_O_ERRORSTS) & NMI_ERRORSTS_PINSTS) != 0U);
}

//*****************************************************************************
//
//! Forces an error flag to set to indicate an error being generated.
//!
//! \return None.
//
//*****************************************************************************

static inline void
SysCtl_forceError(void)
{
  EALLOW;
  HWREGH(NMI_BASE + NMI_O_ERRORSTSFRC) |= NMI_ERRORSTSFRC_ERROR;
  EDIS;
}

//*****************************************************************************
//
//! Clears any error flag set due to error generated.
//!
//! \return None.
//
//*****************************************************************************

static inline void
SysCtl_clearError(void)
{
  EALLOW;
  HWREGH(NMI_BASE + NMI_O_ERRORSTSCLR) |= NMI_ERRORSTSCLR_ERROR;
  EDIS;
}

//*****************************************************************************
//
//! Selects the polarity of the error pin
//!
//! \param pol is the ERROR pin polarity
//!
//! The \e pol parameter can take any of the below values:
//! 0x0U: If an error is already triggered, Error pin will be driven
//! with a value of 0, else 1.
//! 0x1U: If an error is already triggered, Error pin will be driven
//! with a value of 1, else 0.
//!
//! \return None.
//
//*****************************************************************************

static inline void
SysCtl_selectErrPinPolarity(uint16_t pol)
{
  EALLOW;
  //
  //Configures the error pin polarity based on the provided polarity
  //
  if(pol == 1U)
   {
    HWREGH(NMI_BASE + NMI_O_ERRORCTL) |= NMI_ERRORCTL_ERRORPOLSEL;
   }
  else
   {
   HWREGH(NMI_BASE + NMI_O_ERRORCTL) &= ~NMI_ERRORCTL_ERRORPOLSEL;
   }
  EDIS;
}

//*****************************************************************************
//
//! Locks the Error control registers
//!
//! This function locks the Error configuration registers.
//!
//! \return None.
//!
//! \note The lock register is cleared only on a system reset.
//
//*****************************************************************************

static inline void
SysCtl_lockErrControl(void)
{
  EALLOW;
  HWREG(NMI_BASE + NMI_O_ERRORLOCK) = NMI_ERRORLOCK_ERRORCTL;
  EDIS;

